{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}last_log
       {txt}log:  {res}/Users/erinhengel/Dropbox/Readability/draft/0-log/2022-03-21-15-23-31.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}21 Mar 2022, 15:23:31
{txt}
{com}. display as error "{c -(}title:Publishing while Female: Are women held to higher standards? Evidence from peer review.{c )-}" _n "Erin Hengel" _n trim(c(current_date)) ", " c(current_time)
{res}{err}{title:Publishing while Female: Are women held to higher standards? Evidence from peer review.}
Erin Hengel
21 Mar 2022, 15:23:31
{txt}
{com}. 
. * Create datasets.
. include "0-code/output/Data.do"
{txt}
{com}. ********************************************************************************
. ************************************* DATA *************************************
. ********************************************************************************
. * Variable labels.
. import delimited varname label using 0-labels/varlabels.csv, clear
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(2 vars, 120 obs)

{com}. generate command = "capture label variable " + varname + " " + label
{txt}
{com}. tempfile varlabels
{txt}
{com}. outfile command using `varlabels', replace noquote
{txt}{p 0 4 2}
(file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.000002{rm}
not found)
{p_end}

{com}. 
. * Value labels.
. import delimited name value label using 0-labels/vallabels.csv, clear
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(3 vars, 48 obs)

{com}. forvalues i=1/`=_N' {c -(}
{txt}  2{com}.         label define `=name[`i']' `=value[`i']' `=label[`i']', add
{txt}  3{com}. {c )-}
{txt}
{com}. tempfile vallabels
{txt}
{com}. label save using `vallabels', replace
{txt}{p 0 4 2}
(file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.000003{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.000003{rm}
saved
{p_end}

{com}. 
. * Generate editorial clusters.
. import delimited "0-data/generated/editors.csv", clear varnames(1) case(preserve) encoding("utf-8") bindquotes(strict)
{res}{text}(5 vars, 2,806 obs)

{com}. by Journal Volume Issue Part (AuthorID), sort: generate j = _n
{txt}
{com}. reshape wide AuthorID, i(Journal Volume Issue Part) j(j)
{txt}(j = 1 2 3 4 5 6 7 8 9 10 11 12)

Data{col 36}Long{col 43}->{col 48}Wide
{hline 77}
Number of observations     {res}       2,806   {txt}->   {res}1,118       
{txt}Number of variables        {res}           6   {txt}->   {res}16          
{txt}j variable (12 values)                {res}j   {txt}->   (dropped)
xij variables:
                               {res}AuthorID   {txt}->   {res}AuthorID1 AuthorID2 ... AuthorID12
{txt}{hline 77}

{com}. egen Editor = group(AuthorID*), missing
{res}{txt}
{com}. drop AuthorID*
{txt}
{com}. tempfile cluster
{txt}
{com}. save `cluster'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.000004{rm}
saved
as .dta format
{p_end}

{com}. import delimited "0-data/generated/article_editors.csv", clear varnames(1) case(preserve) encoding("utf-8") bindquotes(strict)
{res}{text}(5 vars, 11,695 obs)

{com}. merge m:1 Journal Volume Issue Part using `cluster', keep(match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}          11,695{txt}  
{col 5}{hline 41}

{com}. save `cluster', replace
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.000004{rm}
saved
as .dta format
{p_end}

{com}. 
. * Generate article and author characteristic data.
. import delimited "0-data/generated/article_main.csv", clear varnames(1) case(preserve) encoding("utf-8") bindquotes(strict)
{res}{text}(4 vars, 11,120 obs)

{com}. date_replace PubDate, mask("YMD")
{res}{txt}
{com}. label define Journal 1 "AER" 2 "ECA" 3 "JPE" 4 "QJE" 5 "P&P" 6 "RES"
{txt}
{com}. encode_replace Journal
{res}
{txt}
{com}. tempfile article_tmp
{txt}
{com}. save `article_tmp'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.000005{rm}
saved
as .dta format
{p_end}

{com}. import delimited "0-data/generated/authorcorr.csv", clear varnames(1) case(preserve) encoding("utf-8") bindquotes(strict)
{res}{text}(2 vars, 20,846 obs)

{com}. merge m:1 ArticleID using `article_tmp', assert(master match) keep(match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}          19,528{txt}  
{col 5}{hline 41}

{com}. * Sort order determines how articles published in the same month are ordered.
. * Articles published in the QJE and earlier in an issue assumed to be "newer"
. * b/c shorter review times (Ellison, 2002).
. gsort AuthorID PubDate -Journal -FirstPage
{txt}
{com}. by AuthorID: generate t5 = _n
{txt}
{com}. tempfile author_tmp
{txt}
{com}. save `author_tmp'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.000006{rm}
saved
as .dta format
{p_end}

{com}. import delimited "0-data/generated/article_gender.csv", clear varnames(1) case(preserve) encoding("utf-8") bindquotes(strict)
{res}{text}(6 vars, 20,846 obs)

{com}. label define gender 1 "Female" 0 "Male"
{txt}
{com}. label values Female gender
{txt}
{com}. date_replace PubDate, mask("YMD")
{res}{txt}
{com}. encode_replace Journal
{res}
{txt}
{com}. merge 1:1 ArticleID AuthorID using `author_tmp', assert(master match)
{res}{txt}(label {bf:{txt}Journal} already defined)

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}           1,318
{txt}{col 9}from master{col 30}{res}           1,318{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}          19,528{txt}  (_merge==3)
{col 5}{hline 41}

{com}. generate Errata = _merge == 1 & Journal != 5
{txt}
{com}. drop _merge
{txt}
{com}. * Number of top-five articles at time of publication.
. by AuthorID (PubDate), sort: replace t5 = t5[_n-1] if missing(t5)
{txt}(723 real changes made)

{com}. replace t5 = 0 if missing(t5)
{txt}(595 real changes made)

{com}. * Lifetime top-five publication count.
. by AuthorID, sort: egen T5 = max(t5)
{txt}
{com}. * Author with the highest number of top-five articles at the time of publication.
. by ArticleID, sort: egen Maxt = max(t5)
{txt}
{com}. * Author with the highest lifetime number of top-five publications.
. by ArticleID, sort: egen MaxT = max(T5)
{txt}
{com}. * Number of co-authors.
. by ArticleID, sort: generate N = _N
{txt}
{com}. * Female ratio.
. by ArticleID, sort: egen FemRatio0 = mean(Female)
{txt}
{com}. generate FemRatio = FemRatio0
{txt}
{com}. replace FemRatio = 0 if FemRatio<0.5
{txt}(1,608 real changes made)

{com}. * Senior author.
. generate Senior = t==Maxt
{txt}
{com}. * Number of senior authors.
. by ArticleID, sort: egen SeniorN = total(Senior)
{txt}
{com}. * Female and male seniority.
. tempvar FemSenior
{txt}
{com}. generate `FemSenior' = cond(t==Maxt&Female==1, 1, 0)
{txt}
{com}. by ArticleID, sort: egen FemSenior = max(`FemSenior')
{txt}
{com}. drop `FemSenior'
{txt}
{com}. tempvar ManSenior
{txt}
{com}. generate `ManSenior' = cond(t==Maxt&Female==0, 1, 0)
{txt}
{com}. by ArticleID, sort: egen ManSenior = max(`ManSenior')
{txt}
{com}. drop `ManSenior'
{txt}
{com}. replace FemSenior = FemSenior * FemRatio0 // Make FemSenior proportional to the ratio of female authors.
{txt}(1,165 real changes made)

{com}. replace FemSenior = . if FemSenior>0&ManSenior>0 // Make FemSenior strict (only equal to one if woman is the only senior author).
{txt}(701 real changes made, 701 to missing)

{com}. replace FemSenior = . if FemSenior==0 & FemRatio0>0 // Omit mixed-gendered papers with a male senior author.
{txt}(2,139 real changes made, 2,139 to missing)

{com}. * Senior female among non-senior-authored papers.
. generate FemJunior = FemSenior
{txt}(2,840 missing values generated)

{com}. replace FemJunior = . if t > 3
{txt}(5,933 real changes made, 5,933 to missing)

{com}. * Female solo-authored.
. generate FemSolo = .
{txt}(20,846 missing values generated)

{com}. replace FemSolo = 1 if FemRatio0==1 & N==1
{txt}(366 real changes made)

{com}. replace FemSolo = 0 if FemRatio0==0 & N==1
{txt}(4,681 real changes made)

{com}. * Exclusively female authored.
. generate Fem100 = .
{txt}(20,846 missing values generated)

{com}. replace Fem100 = 1 if FemRatio0==1
{txt}(540 real changes made)

{com}. replace Fem100 = 0 if FemRatio0==0
{txt}(17,002 real changes made)

{com}. * At least 50% female authors.
. generate Fem50 = .
{txt}(20,846 missing values generated)

{com}. replace Fem50 = 1 if FemRatio0>=0.5
{txt}(2,236 real changes made)

{com}. replace Fem50 = 0 if FemRatio0==0
{txt}(17,002 real changes made)

{com}. * At least one female author.
. generate Fem1 = FemRatio0>0
{txt}
{com}. * Save author-level data.
. drop FirstPage PubDate Journal
{txt}
{com}. tempfile author_chars
{txt}
{com}. save `author_chars'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.000007{rm}
saved
as .dta format
{p_end}

{com}. save "0-data/generated/author_chars", replace
{txt}{p 0 4 2}
file {bf}
0-data/generated/author_chars.dta{rm}
saved
{p_end}

{com}. * Save article-level data.
. collapse (firstnm) Maxt MaxT N FemRatio0 FemRatio SeniorN FemSenior FemJunior ManSenior FemSolo Fem100 Fem50 Fem1 Errata, by(ArticleID)
{res}{txt}
{com}. tempfile article_chars
{txt}
{com}. save `article_chars'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.000008{rm}
saved
as .dta format
{p_end}

{com}. save "0-data/generated/article_chars", replace
{txt}{p 0 4 2}
file {bf}
0-data/generated/article_chars.dta{rm}
saved
{p_end}

{com}. 
. * Generate institutional rank.
. import delimited "0-data/generated/inst_rank.csv", clear varnames(1) case(preserve) bindquotes(strict) encoding("utf-8")
{res}{text}(3 vars, 7,501 obs)

{com}. xtset InstID Year
{res}
{col 1}{txt:Panel variable: }{res:InstID}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:Year}{txt:, }{res:{bind:1950}}{txt: to }{res:{bind:2018}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. tssmooth ma maArticleN=ArticleN, window(5)
{txt}The smoother applied was
{res}{p 5 5 5} by InstID : (1/5)*[x(t-5) + x(t-4) + x(t-3) + x(t-2) + x(t-1) + 0*x(t)]; x(t)= ArticleN{p_end}
{txt}
{com}. replace maArticleN = ArticleN if missing(maArticleN)
{txt}(1,716 real changes made)

{com}. egen rankArticleN = rank(maArticleN), by(Year) field
{txt}
{com}. summarize rankArticleN

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
rankArticleN {c |}{res}      7,501    58.59459    36.45034          1        138
{txt}
{com}. egen InstRank = cut(rankArticleN), at(0(1)9, 10(10)60, `=r(max)+1')
{txt}
{com}. tempfile instrank
{txt}
{com}. save `instrank'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.000009{rm}
saved
as .dta format
{p_end}

{com}. import delimited "0-data/generated/inst_rank_author.csv", clear varnames(1) case(preserve) bindquotes(strict) encoding("utf-8")
{res}{text}(4 vars, 26,103 obs)

{com}. merge m:m InstID Year using `instrank', assert(master match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             303
{txt}{col 9}from master{col 30}{res}             303{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}Matched{col 30}{res}          25,800{txt}  
{col 5}{hline 41}

{com}. replace InstRank = 60 if missing(InstRank) // P&P articles involving an unranked affiliation
{txt}(303 real changes made)

{com}. save `instrank', replace
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.000009{rm}
saved
as .dta format
{p_end}

{com}. collapse (min) MaxInst=InstRank, by(ArticleID)
{res}{txt}
{com}. compress
  {txt}variable {bf}{res}MaxInst{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (35,085 bytes saved)

{com}. tempfile article_instrank
{txt}
{com}. save `article_instrank'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.00000a{rm}
saved
as .dta format
{p_end}

{com}. use `instrank', clear
{txt}
{com}. collapse (min) InstRank, by(ArticleID AuthorID)
{res}{txt}
{com}. compress
  {txt}variable {bf}{res}InstRank{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (62,538 bytes saved)

{com}. tempfile author_instrank
{txt}
{com}. save `author_instrank'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.00000b{rm}
saved
as .dta format
{p_end}

{com}. 
. * Generate publication order.
. import delimited "0-data/generated/pub_order.csv", clear varnames(1) case(preserve) bindquotes(strict) encoding("utf-8")
{res}{text}(5 vars, 11,695 obs)

{com}. by Journal Volume Issue (FirstPage), sort: generate PubOrder = _n
{txt}
{com}. keep ArticleID PubOrder
{txt}
{com}. compress
  {txt}variable {bf}{res}PubOrder{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
{txt}  (23,390 bytes saved)

{com}. tempfile order
{txt}
{com}. save `order'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.00000c{rm}
saved
as .dta format
{p_end}

{com}. 
. * Generate native English.
. import delimited "0-data/generated/english.csv", clear varnames(1) case(preserve) bindquotes(strict) encoding("utf-8")
{res}{text}(2 vars, 11,695 obs)

{com}. tempfile english
{txt}
{com}. save `english'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.00000d{rm}
saved
as .dta format
{p_end}

{com}. 
. * Generate theory/empirical.
. import delimited "0-data/fixed/JEL.csv", clear varnames(1) case(preserve) encoding("utf-8") bindquotes(strict)
{res}{text}(3 vars, 859 obs)

{com}. drop Description
{txt}
{com}. tempfile type
{txt}
{com}. save `type'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.00000e{rm}
saved
as .dta format
{p_end}

{com}. import delimited "0-data/generated/theory_emp.csv", clear varnames(1) case(preserve) bindquotes(strict) encoding("utf-8")
{res}{text}(2 vars, 26,265 obs)

{com}. merge m:1 JEL using `type', keep(master match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}           5,044
{txt}{col 9}from master{col 30}{res}           5,044{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}Matched{col 30}{res}          21,221{txt}  
{col 5}{hline 41}

{com}. replace Type = "Other" if missing(Type)
{txt}(22,412 real changes made)

{com}. keep ArticleID Type
{txt}
{com}. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(12,393 observations deleted)

{com}. generate Type_ = 1
{txt}
{com}. reshape wide Type_, i(ArticleID) j(Type) string
{txt}(j = Empirical Other Theory)

Data{col 36}Long{col 43}->{col 48}Wide
{hline 77}
Number of observations     {res}      13,872   {txt}->   {res}11,695      
{txt}Number of variables        {res}           3   {txt}->   {res}4           
{txt}j variable (3 values)              {res}Type   {txt}->   (dropped)
xij variables:
                                  {res}Type_   {txt}->   {res}Type_Empirical Type_Other Type_Theory
{txt}{hline 77}

{com}. foreach var of varlist Type_* {c -(}
{txt}  2{com}.         replace `var' = 0 if missing(`var')
{txt}  3{com}. {c )-}
{txt}(11,139 real changes made)
(766 real changes made)
(9,308 real changes made)

{com}. save `type', replace
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.00000e{rm}
saved
as .dta format
{p_end}

{com}. 
. * Generate primary JEL data.
. import delimited "0-data/generated/primary_jel.csv", clear varnames(1) case(preserve) bindquotes(strict) encoding("utf-8")
{res}{text}(2 vars, 21,593 obs)

{com}. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(7,545 observations deleted)

{com}. encode_replace JEL
{res}
{txt}
{com}. distinct JEL

{txt}{col 8}{c |}        Observations
{col 8}{c |}      total   distinct
{hline 7}{c +}{hline 22}
   JEL {c |}  {res}    14048         19
{txt}
{com}. forvalues i=1/`r(ndistinct)' {c -(}
{txt}  2{com}.         generate JEL1_`:label (JEL) `i'' = JEL == `i'
{txt}  3{com}. {c )-}
{txt}
{com}. collapse (max) JEL1_*, by(ArticleID)
{res}{txt}
{com}. compress
  {txt}variable {bf}{res}JEL1_A{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}JEL1_B{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}JEL1_C{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}JEL1_D{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}JEL1_E{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}JEL1_F{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}JEL1_G{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}JEL1_H{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}JEL1_I{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}JEL1_J{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}JEL1_K{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}JEL1_L{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}JEL1_M{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}JEL1_N{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}JEL1_O{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}JEL1_P{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}JEL1_Q{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}JEL1_R{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}JEL1_Z{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (400,311 bytes saved)

{com}. tempfile primary_jel
{txt}
{com}. save `primary_jel'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.00000f{rm}
saved
as .dta format
{p_end}

{com}. save "0-data/generated/primary_jel", replace
{txt}{p 0 4 2}
file {bf}
0-data/generated/primary_jel.dta{rm}
saved
{p_end}

{com}. 
. * Generate tertiary JEL data.
. import delimited "0-data/generated/tertiary_jel.csv", clear varnames(1) case(preserve) bindquotes(strict) encoding("utf-8")
{res}{text}(2 vars, 21,593 obs)

{com}. encode_replace JEL
{res}
{txt}
{com}. distinct JEL

{txt}{col 8}{c |}        Observations
{col 8}{c |}      total   distinct
{hline 7}{c +}{hline 22}
   JEL {c |}  {res}    21593        737
{txt}
{com}. forvalues i=1/`r(ndistinct)' {c -(}
{txt}  2{com}.         generate byte JEL3_`i' = JEL == `i'
{txt}  3{com}. {c )-}
{txt}
{com}. collapse (max) JEL3_*, by(ArticleID)
{res}{txt}
{com}. compress
{txt}  (0 bytes saved)

{com}. tempfile tertiary_jel
{txt}
{com}. save `tertiary_jel'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.00000g{rm}
saved
as .dta format
{p_end}

{com}. save "0-data/generated/tertiary_jel", replace
{txt}{p 0 4 2}
file {bf}
0-data/generated/tertiary_jel.dta{rm}
saved
{p_end}

{com}. 
. * Generate article-level P&P data.
. import delimited "0-data/generated/article_pp.csv", clear varnames(1) case(preserve) bindquotes(strict) encoding("utf-8")
{res}{text}(11 vars, 106,480 obs)

{com}. reshape wide _, i(ArticleID) j(StatName) string
{txt}(j = char_count dalechall_score flesch_score fleschkincaid_score gunningfog_score notdalechall_count polysyblword_count sent_count smog_score sybl_count word_count)

Data{col 36}Long{col 43}->{col 48}Wide
{hline 77}
Number of observations     {res}     106,480   {txt}->   {res}9,680       
{txt}Number of variables        {res}          11   {txt}->   {res}20          
{txt}j variable (11 values)         {res}StatName   {txt}->   (dropped)
xij variables:
                                      {res}_   {txt}->   {res}_char_count _dalechall_score ... _word_count
{txt}{hline 77}

{com}. merge 1:1 ArticleID using `article_chars', assert(using match) keep(match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           9,680{txt}  
{col 5}{hline 41}

{com}. merge 1:1 ArticleID using `article_instrank', assert(using match) keep(match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           9,680{txt}  
{col 5}{hline 41}

{com}. merge 1:1 ArticleID using `order', assert(using match) keep(match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           9,680{txt}  
{col 5}{hline 41}

{com}. merge 1:1 ArticleID using `cluster', assert(using match) keep(match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           9,680{txt}  
{col 5}{hline 41}

{com}. merge 1:1 ArticleID using `english', assert(using match) keep(match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           9,680{txt}  
{col 5}{hline 41}

{com}. merge 1:1 ArticleID using `type', assert(using match) keep(match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           9,680{txt}  
{col 5}{hline 41}

{com}. merge m:1 ArticleID using "0-data/generated/readstat", assert(using match) keep(match) nogenerate
{res}{txt}{p 0 7 2}
(variable
{bf:ArticleID} was {bf:int}, now {bf:long} to accommodate using data's values)
{p_end}

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           9,680{txt}  
{col 5}{hline 41}

{com}. egen JnlVol = group(Journal Volume)
{txt}
{com}. egen JnlVolIss = group(Journal Volume Issue)
{txt}
{com}. label define Journal 1 "AER" 2 "ECA" 3 "JPE" 4 "QJE" 5 "P&P" 6 "RES"
{txt}
{com}. encode_replace Journal
{res}
{txt}
{com}. date_replace PubDate, mask("YMD")
{res}{txt}
{com}. generate _wps_count = _word_count / _sent_count
{txt}
{com}. generate _pps_count = _polysyblword_count / _sent_count
{txt}
{com}. generate _spw_count = _sybl_count / _word_count
{txt}
{com}. generate _pww_count = _polysyblword_count / _word_count
{txt}
{com}. generate _dww_count = _notdalechall_count / _word_count
{txt}
{com}. generate asinhCiteCount = ln(CiteCount + sqrt(1+CiteCount^2))
{txt}
{com}. generate Blind = Year<=1997&(Journal==4|(PubDate>=date("1989-06-01", "YMD")&Journal==1))
{txt}
{com}. do `varlabels'
{txt}
{com}. capture label variable _flesch_score  "Flesch"
{txt}
{com}. capture label variable _fleschkincaid_score  "Flesch-Kincaid"
{txt}
{com}. capture label variable _gunningfog_score  "Gunning Fog"
{txt}
{com}. capture label variable _smog_score  "SMOG"
{txt}
{com}. capture label variable _dalechall_score  "Dale-Chall"
{txt}
{com}. capture label variable _sent_count  "No. sentences"
{txt}
{com}. capture label variable _char_count  "No. characters"
{txt}
{com}. capture label variable _sybl_count  "No. syllables"
{txt}
{com}. capture label variable _polysyblword_count  "No. polysyllabic words"
{txt}
{com}. capture label variable _word_count  "No. words"
{txt}
{com}. capture label variable _notdalechall_count  "No. difficult words"
{txt}
{com}. capture label variable _wps_count  "No. words / sentence count"
{txt}
{com}. capture label variable _pps_count  "No. polysyllabic words / sentence count"
{txt}
{com}. capture label variable _spw_count  "No. syllables / word count"
{txt}
{com}. capture label variable _pww_count  "No. polysyllabic words / word count"
{txt}
{com}. capture label variable _dww_count  "No. difficult words / word count"
{txt}
{com}. capture label variable FemRatio  "Female ratio"
{txt}
{com}. capture label variable MaxT  "Max. \(T\)"
{txt}
{com}. capture label variable PubN  "\(T\)"
{txt}
{com}. capture label variable N  "\(N_j\)"
{txt}
{com}. capture label variable T  "\(T_5\)"
{txt}
{com}. capture label variable tBin  "Publication count (4 bins)"
{txt}
{com}. capture label variable PubOrder  "Order"
{txt}
{com}. capture label variable PageN  "No. pages"
{txt}
{com}. capture label variable Mother  "Mother"
{txt}
{com}. capture label variable Birth  "Birth"
{txt}
{com}. capture label variable Sex  "Male"
{txt}
{com}. capture label variable CiteCount  "No. citations"
{txt}
{com}. capture label variable asinhCiteCount  "No. citations (asinh)"
{txt}
{com}. capture label variable NberWP  "NBER Working Paper"
{txt}
{com}. capture label variable Gender  "Author gender"
{txt}
{com}. capture label variable JEL1_1  "A General"
{txt}
{com}. capture label variable JEL1_2  "B Methodology"
{txt}
{com}. capture label variable JEL1_3  "C Quant. methods"
{txt}
{com}. capture label variable JEL1_4  "D Microeconomics"
{txt}
{com}. capture label variable JEL1_5  "E Macroeconomics"
{txt}
{com}. capture label variable JEL1_6  "F International"
{txt}
{com}. capture label variable JEL1_7  "G Finance"
{txt}
{com}. capture label variable JEL1_8  "H Public"
{txt}
{com}. capture label variable JEL1_9  "I Health, welfare, edu."
{txt}
{com}. capture label variable JEL1_10  "J Labour"
{txt}
{com}. capture label variable JEL1_11  "K Law and econ."
{txt}
{com}. capture label variable JEL1_12  "L Industrial org."
{txt}
{com}. capture label variable JEL1_13  "M Marketing, accounting"
{txt}
{com}. capture label variable JEL1_14  "N Economic history"
{txt}
{com}. capture label variable JEL1_15  "O Development"
{txt}
{com}. capture label variable JEL1_16  "P Economic systems"
{txt}
{com}. capture label variable JEL1_17  "Q Agri., environment"
{txt}
{com}. capture label variable JEL1_18  "R Regional, transport"
{txt}
{com}. capture label variable JEL1_19  "Y Miscellaneous"
{txt}
{com}. capture label variable JEL1_20  "Z Special topics"
{txt}
{com}. capture label variable AmericanName100  "\(100\) (U.S.)"
{txt}
{com}. capture label variable AmericanName1000  "\(1K\) (U.S.)"
{txt}
{com}. capture label variable AmericanName10000  "\(10K\) (U.S.)"
{txt}
{com}. capture label variable AmericanName100000  "\(100K\) (U.S.)"
{txt}
{com}. capture label variable AmericanName1000000  "\(1M\) (U.S.)"
{txt}
{com}. capture label variable ScottishName  "\(10\) (Scotland)"
{txt}
{com}. capture label variable meanPubOrder "Avg. order in issue"
{txt}
{com}. capture label variable minPubOrder "Min. order in issue"
{txt}
{com}. capture label variable meanN "Avg. \(N_{c -(}it{c )-}\)"
{txt}
{com}. capture label variable maxCiteCount "Max. citations"
{txt}
{com}. capture label variable meanYear "Avg. year"
{txt}
{com}. capture label variable AuthorOrderBin1 "\% no ordering"
{txt}
{com}. capture label variable AuthorOrderBin2 "\% first authored by \(i\)"
{txt}
{com}. capture label variable AuthorOrderBin3 "\% not first author"
{txt}
{com}. capture label variable Decade1 "1950--59"
{txt}
{com}. capture label variable Decade2 "1960--69"
{txt}
{com}. capture label variable Decade3 "1970--79"
{txt}
{com}. capture label variable Decade4 "1980--89"
{txt}
{com}. capture label variable Decade5 "1990--99"
{txt}
{com}. capture label variable Decade6 "2000--09"
{txt}
{com}. capture label variable Decade7 "2010--15"
{txt}
{com}. capture label variable minInstRank "Min. inst. rank"
{txt}
{com}. capture label variable meanInstRank "Avg. inst. rank"
{txt}
{com}. capture label variable maxInstRank "Max. inst. rank"
{txt}
{com}. capture label variable Journal1 "\textit{c -(}AER{c )-}"
{txt}
{com}. capture label variable Journal2 "\textit{c -(}Econometrica{c )-}"
{txt}
{com}. capture label variable Journal3 "\textit{c -(}JPE{c )-}"
{txt}
{com}. capture label variable Journal4 "\textit{c -(}QJE{c )-}"
{txt}
{com}. capture label variable JEL1_A  "A General"
{txt}
{com}. capture label variable JEL1_B  "B Methodology"
{txt}
{com}. capture label variable JEL1_C  "C Quant. methods"
{txt}
{com}. capture label variable JEL1_D  "D Microeconomics"
{txt}
{com}. capture label variable JEL1_E  "E Macroeconomics"
{txt}
{com}. capture label variable JEL1_F  "F International"
{txt}
{com}. capture label variable JEL1_G  "G Finance"
{txt}
{com}. capture label variable JEL1_H  "H Public"
{txt}
{com}. capture label variable JEL1_I  "I Health, welfare, edu."
{txt}
{com}. capture label variable JEL1_J  "J Labour"
{txt}
{com}. capture label variable JEL1_K  "K Law and econ."
{txt}
{com}. capture label variable JEL1_L  "L Industrial org."
{txt}
{com}. capture label variable JEL1_M  "M Marketing/acct."
{txt}
{com}. capture label variable JEL1_N  "N Economic history"
{txt}
{com}. capture label variable JEL1_O  "O Development"
{txt}
{com}. capture label variable JEL1_P  "P Economic systems"
{txt}
{com}. capture label variable JEL1_Q  "Q Agri., environment"
{txt}
{com}. capture label variable JEL1_R  "R Regional, transport"
{txt}
{com}. capture label variable JEL1_Y  "Y Miscellaneous"
{txt}
{com}. capture label variable JEL1_Z  "Z Special topics"
{txt}
{com}. capture label variable InstRank "Inst. rank"
{txt}
{com}. capture label variable MaxInst "Max. inst. rank"
{txt}
{com}. capture label variable Maxt "Max. \(t\)"
{txt}
{com}. capture label variable Blind "Blind review"
{txt}
{com}. capture label variable NativeEnglish  "Native English speaker"
{txt}
{com}. capture label variable Fem50  "Majority female"
{txt}
{com}. capture label variable Fem100  "Exclusively female"
{txt}
{com}. capture label variable FemSenior  "Senior female"
{txt}
{com}. capture label variable FemJunior "Sr. female (\(t\le3\))"
{txt}
{com}. capture label variable FemSolo  "Solo female"
{txt}
{com}. capture label variable Fem1  "1+ female"
{txt}
{com}. capture label variable FirstInst  "\(t=1\) inst. rank"
{txt}
{com}. capture label variable article_r_fleschkincaid_score  "Flesch-Kincaid"
{txt}
{com}. capture label variable article_r_gunningfog_score  "Gunning Fog"
{txt}
{com}. capture label variable article_r_smog_score  "SMOG"
{txt}
{com}. capture label variable article_r_fleschkincaid_score  "Flesch-Kincaid"
{txt}
{com}. capture label variable article_r_gunningfog_score  "Gunning Fog"
{txt}
{com}. capture label variable article_r_smog_score  "SMOG"
{txt}
{com}. capture label variable Type_Theory  "Theory"
{txt}
{com}. capture label variable Type_Empirical  "Empirical"
{txt}
{com}. capture label variable Type_Other  "Other"
{txt}
{com}. 
{txt}end of do-file

{com}. compress
  {txt}variable {bf}{res}ArticleID{sf}{txt} was {bf}{res}long{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}_char_count{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}_notdalechall_count{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}_polysyblword_count{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}_sent_count{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}_sybl_count{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}_word_count{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}Maxt{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}MaxT{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}N{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}SeniorN{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}ManSenior{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}FemSolo{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Fem100{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Fem50{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Fem1{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Errata{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Editor{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}Type_Empirical{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Type_Other{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Type_Theory{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}JnlVol{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}JnlVolIss{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}Journal{sf}{txt} was {bf}{res}long{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}PubDate{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}Blind{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (658,240 bytes saved)

{com}. tempfile article_pp
{txt}
{com}. save `article_pp'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.00000h{rm}
saved
as .dta format
{p_end}

{com}. save "0-data/generated/article_pp", replace
{txt}{p 0 4 2}
file {bf}
0-data/generated/article_pp.dta{rm}
saved
{p_end}

{com}. 
. * Generate article-level data.
. * Generate article data.
. use `article_pp'
{txt}
{com}. drop if Journal==5
{txt}(563 observations deleted)

{com}. tempfile article
{txt}
{com}. save `article'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.00000i{rm}
saved
as .dta format
{p_end}

{com}. save "0-data/generated/article", replace
{txt}{p 0 4 2}
file {bf}
0-data/generated/article.dta{rm}
saved
{p_end}

{com}. 
. * Generate article-level JEL data.
. use `article', clear
{txt}
{com}. merge 1:1 ArticleID using `primary_jel', keep(match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           5,211{txt}  
{col 5}{hline 41}

{com}. do `varlabels'
{txt}
{com}. capture label variable _flesch_score  "Flesch"
{txt}
{com}. capture label variable _fleschkincaid_score  "Flesch-Kincaid"
{txt}
{com}. capture label variable _gunningfog_score  "Gunning Fog"
{txt}
{com}. capture label variable _smog_score  "SMOG"
{txt}
{com}. capture label variable _dalechall_score  "Dale-Chall"
{txt}
{com}. capture label variable _sent_count  "No. sentences"
{txt}
{com}. capture label variable _char_count  "No. characters"
{txt}
{com}. capture label variable _sybl_count  "No. syllables"
{txt}
{com}. capture label variable _polysyblword_count  "No. polysyllabic words"
{txt}
{com}. capture label variable _word_count  "No. words"
{txt}
{com}. capture label variable _notdalechall_count  "No. difficult words"
{txt}
{com}. capture label variable _wps_count  "No. words / sentence count"
{txt}
{com}. capture label variable _pps_count  "No. polysyllabic words / sentence count"
{txt}
{com}. capture label variable _spw_count  "No. syllables / word count"
{txt}
{com}. capture label variable _pww_count  "No. polysyllabic words / word count"
{txt}
{com}. capture label variable _dww_count  "No. difficult words / word count"
{txt}
{com}. capture label variable FemRatio  "Female ratio"
{txt}
{com}. capture label variable MaxT  "Max. \(T\)"
{txt}
{com}. capture label variable PubN  "\(T\)"
{txt}
{com}. capture label variable N  "\(N_j\)"
{txt}
{com}. capture label variable T  "\(T_5\)"
{txt}
{com}. capture label variable tBin  "Publication count (4 bins)"
{txt}
{com}. capture label variable PubOrder  "Order"
{txt}
{com}. capture label variable PageN  "No. pages"
{txt}
{com}. capture label variable Mother  "Mother"
{txt}
{com}. capture label variable Birth  "Birth"
{txt}
{com}. capture label variable Sex  "Male"
{txt}
{com}. capture label variable CiteCount  "No. citations"
{txt}
{com}. capture label variable asinhCiteCount  "No. citations (asinh)"
{txt}
{com}. capture label variable NberWP  "NBER Working Paper"
{txt}
{com}. capture label variable Gender  "Author gender"
{txt}
{com}. capture label variable JEL1_1  "A General"
{txt}
{com}. capture label variable JEL1_2  "B Methodology"
{txt}
{com}. capture label variable JEL1_3  "C Quant. methods"
{txt}
{com}. capture label variable JEL1_4  "D Microeconomics"
{txt}
{com}. capture label variable JEL1_5  "E Macroeconomics"
{txt}
{com}. capture label variable JEL1_6  "F International"
{txt}
{com}. capture label variable JEL1_7  "G Finance"
{txt}
{com}. capture label variable JEL1_8  "H Public"
{txt}
{com}. capture label variable JEL1_9  "I Health, welfare, edu."
{txt}
{com}. capture label variable JEL1_10  "J Labour"
{txt}
{com}. capture label variable JEL1_11  "K Law and econ."
{txt}
{com}. capture label variable JEL1_12  "L Industrial org."
{txt}
{com}. capture label variable JEL1_13  "M Marketing, accounting"
{txt}
{com}. capture label variable JEL1_14  "N Economic history"
{txt}
{com}. capture label variable JEL1_15  "O Development"
{txt}
{com}. capture label variable JEL1_16  "P Economic systems"
{txt}
{com}. capture label variable JEL1_17  "Q Agri., environment"
{txt}
{com}. capture label variable JEL1_18  "R Regional, transport"
{txt}
{com}. capture label variable JEL1_19  "Y Miscellaneous"
{txt}
{com}. capture label variable JEL1_20  "Z Special topics"
{txt}
{com}. capture label variable AmericanName100  "\(100\) (U.S.)"
{txt}
{com}. capture label variable AmericanName1000  "\(1K\) (U.S.)"
{txt}
{com}. capture label variable AmericanName10000  "\(10K\) (U.S.)"
{txt}
{com}. capture label variable AmericanName100000  "\(100K\) (U.S.)"
{txt}
{com}. capture label variable AmericanName1000000  "\(1M\) (U.S.)"
{txt}
{com}. capture label variable ScottishName  "\(10\) (Scotland)"
{txt}
{com}. capture label variable meanPubOrder "Avg. order in issue"
{txt}
{com}. capture label variable minPubOrder "Min. order in issue"
{txt}
{com}. capture label variable meanN "Avg. \(N_{c -(}it{c )-}\)"
{txt}
{com}. capture label variable maxCiteCount "Max. citations"
{txt}
{com}. capture label variable meanYear "Avg. year"
{txt}
{com}. capture label variable AuthorOrderBin1 "\% no ordering"
{txt}
{com}. capture label variable AuthorOrderBin2 "\% first authored by \(i\)"
{txt}
{com}. capture label variable AuthorOrderBin3 "\% not first author"
{txt}
{com}. capture label variable Decade1 "1950--59"
{txt}
{com}. capture label variable Decade2 "1960--69"
{txt}
{com}. capture label variable Decade3 "1970--79"
{txt}
{com}. capture label variable Decade4 "1980--89"
{txt}
{com}. capture label variable Decade5 "1990--99"
{txt}
{com}. capture label variable Decade6 "2000--09"
{txt}
{com}. capture label variable Decade7 "2010--15"
{txt}
{com}. capture label variable minInstRank "Min. inst. rank"
{txt}
{com}. capture label variable meanInstRank "Avg. inst. rank"
{txt}
{com}. capture label variable maxInstRank "Max. inst. rank"
{txt}
{com}. capture label variable Journal1 "\textit{c -(}AER{c )-}"
{txt}
{com}. capture label variable Journal2 "\textit{c -(}Econometrica{c )-}"
{txt}
{com}. capture label variable Journal3 "\textit{c -(}JPE{c )-}"
{txt}
{com}. capture label variable Journal4 "\textit{c -(}QJE{c )-}"
{txt}
{com}. capture label variable JEL1_A  "A General"
{txt}
{com}. capture label variable JEL1_B  "B Methodology"
{txt}
{com}. capture label variable JEL1_C  "C Quant. methods"
{txt}
{com}. capture label variable JEL1_D  "D Microeconomics"
{txt}
{com}. capture label variable JEL1_E  "E Macroeconomics"
{txt}
{com}. capture label variable JEL1_F  "F International"
{txt}
{com}. capture label variable JEL1_G  "G Finance"
{txt}
{com}. capture label variable JEL1_H  "H Public"
{txt}
{com}. capture label variable JEL1_I  "I Health, welfare, edu."
{txt}
{com}. capture label variable JEL1_J  "J Labour"
{txt}
{com}. capture label variable JEL1_K  "K Law and econ."
{txt}
{com}. capture label variable JEL1_L  "L Industrial org."
{txt}
{com}. capture label variable JEL1_M  "M Marketing/acct."
{txt}
{com}. capture label variable JEL1_N  "N Economic history"
{txt}
{com}. capture label variable JEL1_O  "O Development"
{txt}
{com}. capture label variable JEL1_P  "P Economic systems"
{txt}
{com}. capture label variable JEL1_Q  "Q Agri., environment"
{txt}
{com}. capture label variable JEL1_R  "R Regional, transport"
{txt}
{com}. capture label variable JEL1_Y  "Y Miscellaneous"
{txt}
{com}. capture label variable JEL1_Z  "Z Special topics"
{txt}
{com}. capture label variable InstRank "Inst. rank"
{txt}
{com}. capture label variable MaxInst "Max. inst. rank"
{txt}
{com}. capture label variable Maxt "Max. \(t\)"
{txt}
{com}. capture label variable Blind "Blind review"
{txt}
{com}. capture label variable NativeEnglish  "Native English speaker"
{txt}
{com}. capture label variable Fem50  "Majority female"
{txt}
{com}. capture label variable Fem100  "Exclusively female"
{txt}
{com}. capture label variable FemSenior  "Senior female"
{txt}
{com}. capture label variable FemJunior "Sr. female (\(t\le3\))"
{txt}
{com}. capture label variable FemSolo  "Solo female"
{txt}
{com}. capture label variable Fem1  "1+ female"
{txt}
{com}. capture label variable FirstInst  "\(t=1\) inst. rank"
{txt}
{com}. capture label variable article_r_fleschkincaid_score  "Flesch-Kincaid"
{txt}
{com}. capture label variable article_r_gunningfog_score  "Gunning Fog"
{txt}
{com}. capture label variable article_r_smog_score  "SMOG"
{txt}
{com}. capture label variable article_r_fleschkincaid_score  "Flesch-Kincaid"
{txt}
{com}. capture label variable article_r_gunningfog_score  "Gunning Fog"
{txt}
{com}. capture label variable article_r_smog_score  "SMOG"
{txt}
{com}. capture label variable Type_Theory  "Theory"
{txt}
{com}. capture label variable Type_Empirical  "Empirical"
{txt}
{com}. capture label variable Type_Other  "Other"
{txt}
{com}. 
{txt}end of do-file

{com}. compress
  {txt}variable {bf}{res}PubOrder{sf}{txt} was {bf}{res}int{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Issue{sf}{txt} was {bf}{res}str10{sf}{txt} now {bf}{res}str2{sf}
{txt}  (46,899 bytes saved)

{com}. tempfile article_primary_jel
{txt}
{com}. save `article_primary_jel'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.00000j{rm}
saved
as .dta format
{p_end}

{com}. save "0-data/generated/article_primary_jel", replace
{txt}{p 0 4 2}
file {bf}
0-data/generated/article_primary_jel.dta{rm}
saved
{p_end}

{com}. 
. * Generate article-level JEL data + P&P.
. use `article_pp', clear
{txt}
{com}. merge 1:1 ArticleID using `primary_jel', keep(match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           5,774{txt}  
{col 5}{hline 41}

{com}. do `varlabels'
{txt}
{com}. capture label variable _flesch_score  "Flesch"
{txt}
{com}. capture label variable _fleschkincaid_score  "Flesch-Kincaid"
{txt}
{com}. capture label variable _gunningfog_score  "Gunning Fog"
{txt}
{com}. capture label variable _smog_score  "SMOG"
{txt}
{com}. capture label variable _dalechall_score  "Dale-Chall"
{txt}
{com}. capture label variable _sent_count  "No. sentences"
{txt}
{com}. capture label variable _char_count  "No. characters"
{txt}
{com}. capture label variable _sybl_count  "No. syllables"
{txt}
{com}. capture label variable _polysyblword_count  "No. polysyllabic words"
{txt}
{com}. capture label variable _word_count  "No. words"
{txt}
{com}. capture label variable _notdalechall_count  "No. difficult words"
{txt}
{com}. capture label variable _wps_count  "No. words / sentence count"
{txt}
{com}. capture label variable _pps_count  "No. polysyllabic words / sentence count"
{txt}
{com}. capture label variable _spw_count  "No. syllables / word count"
{txt}
{com}. capture label variable _pww_count  "No. polysyllabic words / word count"
{txt}
{com}. capture label variable _dww_count  "No. difficult words / word count"
{txt}
{com}. capture label variable FemRatio  "Female ratio"
{txt}
{com}. capture label variable MaxT  "Max. \(T\)"
{txt}
{com}. capture label variable PubN  "\(T\)"
{txt}
{com}. capture label variable N  "\(N_j\)"
{txt}
{com}. capture label variable T  "\(T_5\)"
{txt}
{com}. capture label variable tBin  "Publication count (4 bins)"
{txt}
{com}. capture label variable PubOrder  "Order"
{txt}
{com}. capture label variable PageN  "No. pages"
{txt}
{com}. capture label variable Mother  "Mother"
{txt}
{com}. capture label variable Birth  "Birth"
{txt}
{com}. capture label variable Sex  "Male"
{txt}
{com}. capture label variable CiteCount  "No. citations"
{txt}
{com}. capture label variable asinhCiteCount  "No. citations (asinh)"
{txt}
{com}. capture label variable NberWP  "NBER Working Paper"
{txt}
{com}. capture label variable Gender  "Author gender"
{txt}
{com}. capture label variable JEL1_1  "A General"
{txt}
{com}. capture label variable JEL1_2  "B Methodology"
{txt}
{com}. capture label variable JEL1_3  "C Quant. methods"
{txt}
{com}. capture label variable JEL1_4  "D Microeconomics"
{txt}
{com}. capture label variable JEL1_5  "E Macroeconomics"
{txt}
{com}. capture label variable JEL1_6  "F International"
{txt}
{com}. capture label variable JEL1_7  "G Finance"
{txt}
{com}. capture label variable JEL1_8  "H Public"
{txt}
{com}. capture label variable JEL1_9  "I Health, welfare, edu."
{txt}
{com}. capture label variable JEL1_10  "J Labour"
{txt}
{com}. capture label variable JEL1_11  "K Law and econ."
{txt}
{com}. capture label variable JEL1_12  "L Industrial org."
{txt}
{com}. capture label variable JEL1_13  "M Marketing, accounting"
{txt}
{com}. capture label variable JEL1_14  "N Economic history"
{txt}
{com}. capture label variable JEL1_15  "O Development"
{txt}
{com}. capture label variable JEL1_16  "P Economic systems"
{txt}
{com}. capture label variable JEL1_17  "Q Agri., environment"
{txt}
{com}. capture label variable JEL1_18  "R Regional, transport"
{txt}
{com}. capture label variable JEL1_19  "Y Miscellaneous"
{txt}
{com}. capture label variable JEL1_20  "Z Special topics"
{txt}
{com}. capture label variable AmericanName100  "\(100\) (U.S.)"
{txt}
{com}. capture label variable AmericanName1000  "\(1K\) (U.S.)"
{txt}
{com}. capture label variable AmericanName10000  "\(10K\) (U.S.)"
{txt}
{com}. capture label variable AmericanName100000  "\(100K\) (U.S.)"
{txt}
{com}. capture label variable AmericanName1000000  "\(1M\) (U.S.)"
{txt}
{com}. capture label variable ScottishName  "\(10\) (Scotland)"
{txt}
{com}. capture label variable meanPubOrder "Avg. order in issue"
{txt}
{com}. capture label variable minPubOrder "Min. order in issue"
{txt}
{com}. capture label variable meanN "Avg. \(N_{c -(}it{c )-}\)"
{txt}
{com}. capture label variable maxCiteCount "Max. citations"
{txt}
{com}. capture label variable meanYear "Avg. year"
{txt}
{com}. capture label variable AuthorOrderBin1 "\% no ordering"
{txt}
{com}. capture label variable AuthorOrderBin2 "\% first authored by \(i\)"
{txt}
{com}. capture label variable AuthorOrderBin3 "\% not first author"
{txt}
{com}. capture label variable Decade1 "1950--59"
{txt}
{com}. capture label variable Decade2 "1960--69"
{txt}
{com}. capture label variable Decade3 "1970--79"
{txt}
{com}. capture label variable Decade4 "1980--89"
{txt}
{com}. capture label variable Decade5 "1990--99"
{txt}
{com}. capture label variable Decade6 "2000--09"
{txt}
{com}. capture label variable Decade7 "2010--15"
{txt}
{com}. capture label variable minInstRank "Min. inst. rank"
{txt}
{com}. capture label variable meanInstRank "Avg. inst. rank"
{txt}
{com}. capture label variable maxInstRank "Max. inst. rank"
{txt}
{com}. capture label variable Journal1 "\textit{c -(}AER{c )-}"
{txt}
{com}. capture label variable Journal2 "\textit{c -(}Econometrica{c )-}"
{txt}
{com}. capture label variable Journal3 "\textit{c -(}JPE{c )-}"
{txt}
{com}. capture label variable Journal4 "\textit{c -(}QJE{c )-}"
{txt}
{com}. capture label variable JEL1_A  "A General"
{txt}
{com}. capture label variable JEL1_B  "B Methodology"
{txt}
{com}. capture label variable JEL1_C  "C Quant. methods"
{txt}
{com}. capture label variable JEL1_D  "D Microeconomics"
{txt}
{com}. capture label variable JEL1_E  "E Macroeconomics"
{txt}
{com}. capture label variable JEL1_F  "F International"
{txt}
{com}. capture label variable JEL1_G  "G Finance"
{txt}
{com}. capture label variable JEL1_H  "H Public"
{txt}
{com}. capture label variable JEL1_I  "I Health, welfare, edu."
{txt}
{com}. capture label variable JEL1_J  "J Labour"
{txt}
{com}. capture label variable JEL1_K  "K Law and econ."
{txt}
{com}. capture label variable JEL1_L  "L Industrial org."
{txt}
{com}. capture label variable JEL1_M  "M Marketing/acct."
{txt}
{com}. capture label variable JEL1_N  "N Economic history"
{txt}
{com}. capture label variable JEL1_O  "O Development"
{txt}
{com}. capture label variable JEL1_P  "P Economic systems"
{txt}
{com}. capture label variable JEL1_Q  "Q Agri., environment"
{txt}
{com}. capture label variable JEL1_R  "R Regional, transport"
{txt}
{com}. capture label variable JEL1_Y  "Y Miscellaneous"
{txt}
{com}. capture label variable JEL1_Z  "Z Special topics"
{txt}
{com}. capture label variable InstRank "Inst. rank"
{txt}
{com}. capture label variable MaxInst "Max. inst. rank"
{txt}
{com}. capture label variable Maxt "Max. \(t\)"
{txt}
{com}. capture label variable Blind "Blind review"
{txt}
{com}. capture label variable NativeEnglish  "Native English speaker"
{txt}
{com}. capture label variable Fem50  "Majority female"
{txt}
{com}. capture label variable Fem100  "Exclusively female"
{txt}
{com}. capture label variable FemSenior  "Senior female"
{txt}
{com}. capture label variable FemJunior "Sr. female (\(t\le3\))"
{txt}
{com}. capture label variable FemSolo  "Solo female"
{txt}
{com}. capture label variable Fem1  "1+ female"
{txt}
{com}. capture label variable FirstInst  "\(t=1\) inst. rank"
{txt}
{com}. capture label variable article_r_fleschkincaid_score  "Flesch-Kincaid"
{txt}
{com}. capture label variable article_r_gunningfog_score  "Gunning Fog"
{txt}
{com}. capture label variable article_r_smog_score  "SMOG"
{txt}
{com}. capture label variable article_r_fleschkincaid_score  "Flesch-Kincaid"
{txt}
{com}. capture label variable article_r_gunningfog_score  "Gunning Fog"
{txt}
{com}. capture label variable article_r_smog_score  "SMOG"
{txt}
{com}. capture label variable Type_Theory  "Theory"
{txt}
{com}. capture label variable Type_Empirical  "Empirical"
{txt}
{com}. capture label variable Type_Other  "Other"
{txt}
{com}. 
{txt}end of do-file

{com}. compress
  {txt}variable {bf}{res}Issue{sf}{txt} was {bf}{res}str10{sf}{txt} now {bf}{res}str2{sf}
{txt}  (46,192 bytes saved)

{com}. tempfile article_primary_jel_pp
{txt}
{com}. save `article_primary_jel_pp'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.00000k{rm}
saved
as .dta format
{p_end}

{com}. save "0-data/generated/article_primary_jel_pp", replace
{txt}{p 0 4 2}
file {bf}
0-data/generated/article_primary_jel_pp.dta{rm}
saved
{p_end}

{com}. 
. * Generate tertiary JEL data.
. use `article', clear
{txt}
{com}. merge 1:1 ArticleID using `tertiary_jel', keep(match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           5,211{txt}  
{col 5}{hline 41}

{com}. compress
  {txt}variable {bf}{res}PubOrder{sf}{txt} was {bf}{res}int{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Issue{sf}{txt} was {bf}{res}str10{sf}{txt} now {bf}{res}str2{sf}
{txt}  (46,899 bytes saved)

{com}. tempfile article_tertiary_jel
{txt}
{com}. save `article_tertiary_jel'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.00000l{rm}
saved
as .dta format
{p_end}

{com}. save "0-data/generated/article_tertiary_jel", replace
{txt}{p 0 4 2}
file {bf}
0-data/generated/article_tertiary_jel.dta{rm}
saved
{p_end}

{com}. 
. * Generate tertiary JEL data + P&P.
. use `article_pp', clear
{txt}
{com}. merge 1:1 ArticleID using `tertiary_jel', keep(match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           5,774{txt}  
{col 5}{hline 41}

{com}. compress
  {txt}variable {bf}{res}Issue{sf}{txt} was {bf}{res}str10{sf}{txt} now {bf}{res}str2{sf}
{txt}  (46,192 bytes saved)

{com}. tempfile article_tertiary_jel_pp
{txt}
{com}. save `article_tertiary_jel_pp'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.00000m{rm}
saved
as .dta format
{p_end}

{com}. save "0-data/generated/article_tertiary_jel_pp", replace
{txt}{p 0 4 2}
file {bf}
0-data/generated/article_tertiary_jel_pp.dta{rm}
saved
{p_end}

{com}. 
. * Generate author-level data for top four journals.
. use `author_chars', clear
{txt}
{com}. merge m:1 ArticleID using `article', assert(master match) keep(match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}          16,055{txt}  
{col 5}{hline 41}

{com}. merge m:1 ArticleID AuthorID using `author_instrank', assert(using match) keep(match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}          16,055{txt}  
{col 5}{hline 41}

{com}. * Sort order determines how articles published in the same month are ordered.
. * Articles published in the QJE and earlier in an issue assumed to be "newer"
. * b/c shorter review times (Ellison, 2002).
. gsort AuthorID PubDate -Journal -FirstPage
{txt}
{com}. by AuthorID, sort: generate t = _n
{txt}
{com}. by AuthorID, sort: egen T = max(t)
{txt}
{com}. * Downweight duplicate observations (i.e., co-authored papers).
. * Weights are inversely proportionate to the number of co-authors.
. bysort ArticleID: generate AuthorWeight = _N
{txt}
{com}. summarize AuthorWeight

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
AuthorWeight {c |}{res}     16,055      2.1417    .9200855          1          8
{txt}
{com}. replace AuthorWeight = r(max) + 1 - AuthorWeight
{txt}(16,055 real changes made)

{com}. egen AuthorEditor = group(AuthorID Editor)
{txt}
{com}. recode t (1=1)(2=2)(3/6=3)(nonmissing=4), generate(tBin)
{txt}(4679 differences between {bf:t} and {bf:tBin})

{com}. xtset AuthorID t
{res}
{col 1}{txt:Panel variable: }{res:AuthorID}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:t}{txt:, }{res:{bind:1}}{txt: to }{res:{bind:45}}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. fvset base 64 Year
{txt}
{com}. fvset base 80 Editor
{txt}
{com}. fvset base 64 MaxInst
{txt}
{com}. fvset base 30 MaxT
{txt}
{com}. do `varlabels'
{txt}
{com}. capture label variable _flesch_score  "Flesch"
{txt}
{com}. capture label variable _fleschkincaid_score  "Flesch-Kincaid"
{txt}
{com}. capture label variable _gunningfog_score  "Gunning Fog"
{txt}
{com}. capture label variable _smog_score  "SMOG"
{txt}
{com}. capture label variable _dalechall_score  "Dale-Chall"
{txt}
{com}. capture label variable _sent_count  "No. sentences"
{txt}
{com}. capture label variable _char_count  "No. characters"
{txt}
{com}. capture label variable _sybl_count  "No. syllables"
{txt}
{com}. capture label variable _polysyblword_count  "No. polysyllabic words"
{txt}
{com}. capture label variable _word_count  "No. words"
{txt}
{com}. capture label variable _notdalechall_count  "No. difficult words"
{txt}
{com}. capture label variable _wps_count  "No. words / sentence count"
{txt}
{com}. capture label variable _pps_count  "No. polysyllabic words / sentence count"
{txt}
{com}. capture label variable _spw_count  "No. syllables / word count"
{txt}
{com}. capture label variable _pww_count  "No. polysyllabic words / word count"
{txt}
{com}. capture label variable _dww_count  "No. difficult words / word count"
{txt}
{com}. capture label variable FemRatio  "Female ratio"
{txt}
{com}. capture label variable MaxT  "Max. \(T\)"
{txt}
{com}. capture label variable PubN  "\(T\)"
{txt}
{com}. capture label variable N  "\(N_j\)"
{txt}
{com}. capture label variable T  "\(T_5\)"
{txt}
{com}. capture label variable tBin  "Publication count (4 bins)"
{txt}
{com}. capture label variable PubOrder  "Order"
{txt}
{com}. capture label variable PageN  "No. pages"
{txt}
{com}. capture label variable Mother  "Mother"
{txt}
{com}. capture label variable Birth  "Birth"
{txt}
{com}. capture label variable Sex  "Male"
{txt}
{com}. capture label variable CiteCount  "No. citations"
{txt}
{com}. capture label variable asinhCiteCount  "No. citations (asinh)"
{txt}
{com}. capture label variable NberWP  "NBER Working Paper"
{txt}
{com}. capture label variable Gender  "Author gender"
{txt}
{com}. capture label variable JEL1_1  "A General"
{txt}
{com}. capture label variable JEL1_2  "B Methodology"
{txt}
{com}. capture label variable JEL1_3  "C Quant. methods"
{txt}
{com}. capture label variable JEL1_4  "D Microeconomics"
{txt}
{com}. capture label variable JEL1_5  "E Macroeconomics"
{txt}
{com}. capture label variable JEL1_6  "F International"
{txt}
{com}. capture label variable JEL1_7  "G Finance"
{txt}
{com}. capture label variable JEL1_8  "H Public"
{txt}
{com}. capture label variable JEL1_9  "I Health, welfare, edu."
{txt}
{com}. capture label variable JEL1_10  "J Labour"
{txt}
{com}. capture label variable JEL1_11  "K Law and econ."
{txt}
{com}. capture label variable JEL1_12  "L Industrial org."
{txt}
{com}. capture label variable JEL1_13  "M Marketing, accounting"
{txt}
{com}. capture label variable JEL1_14  "N Economic history"
{txt}
{com}. capture label variable JEL1_15  "O Development"
{txt}
{com}. capture label variable JEL1_16  "P Economic systems"
{txt}
{com}. capture label variable JEL1_17  "Q Agri., environment"
{txt}
{com}. capture label variable JEL1_18  "R Regional, transport"
{txt}
{com}. capture label variable JEL1_19  "Y Miscellaneous"
{txt}
{com}. capture label variable JEL1_20  "Z Special topics"
{txt}
{com}. capture label variable AmericanName100  "\(100\) (U.S.)"
{txt}
{com}. capture label variable AmericanName1000  "\(1K\) (U.S.)"
{txt}
{com}. capture label variable AmericanName10000  "\(10K\) (U.S.)"
{txt}
{com}. capture label variable AmericanName100000  "\(100K\) (U.S.)"
{txt}
{com}. capture label variable AmericanName1000000  "\(1M\) (U.S.)"
{txt}
{com}. capture label variable ScottishName  "\(10\) (Scotland)"
{txt}
{com}. capture label variable meanPubOrder "Avg. order in issue"
{txt}
{com}. capture label variable minPubOrder "Min. order in issue"
{txt}
{com}. capture label variable meanN "Avg. \(N_{c -(}it{c )-}\)"
{txt}
{com}. capture label variable maxCiteCount "Max. citations"
{txt}
{com}. capture label variable meanYear "Avg. year"
{txt}
{com}. capture label variable AuthorOrderBin1 "\% no ordering"
{txt}
{com}. capture label variable AuthorOrderBin2 "\% first authored by \(i\)"
{txt}
{com}. capture label variable AuthorOrderBin3 "\% not first author"
{txt}
{com}. capture label variable Decade1 "1950--59"
{txt}
{com}. capture label variable Decade2 "1960--69"
{txt}
{com}. capture label variable Decade3 "1970--79"
{txt}
{com}. capture label variable Decade4 "1980--89"
{txt}
{com}. capture label variable Decade5 "1990--99"
{txt}
{com}. capture label variable Decade6 "2000--09"
{txt}
{com}. capture label variable Decade7 "2010--15"
{txt}
{com}. capture label variable minInstRank "Min. inst. rank"
{txt}
{com}. capture label variable meanInstRank "Avg. inst. rank"
{txt}
{com}. capture label variable maxInstRank "Max. inst. rank"
{txt}
{com}. capture label variable Journal1 "\textit{c -(}AER{c )-}"
{txt}
{com}. capture label variable Journal2 "\textit{c -(}Econometrica{c )-}"
{txt}
{com}. capture label variable Journal3 "\textit{c -(}JPE{c )-}"
{txt}
{com}. capture label variable Journal4 "\textit{c -(}QJE{c )-}"
{txt}
{com}. capture label variable JEL1_A  "A General"
{txt}
{com}. capture label variable JEL1_B  "B Methodology"
{txt}
{com}. capture label variable JEL1_C  "C Quant. methods"
{txt}
{com}. capture label variable JEL1_D  "D Microeconomics"
{txt}
{com}. capture label variable JEL1_E  "E Macroeconomics"
{txt}
{com}. capture label variable JEL1_F  "F International"
{txt}
{com}. capture label variable JEL1_G  "G Finance"
{txt}
{com}. capture label variable JEL1_H  "H Public"
{txt}
{com}. capture label variable JEL1_I  "I Health, welfare, edu."
{txt}
{com}. capture label variable JEL1_J  "J Labour"
{txt}
{com}. capture label variable JEL1_K  "K Law and econ."
{txt}
{com}. capture label variable JEL1_L  "L Industrial org."
{txt}
{com}. capture label variable JEL1_M  "M Marketing/acct."
{txt}
{com}. capture label variable JEL1_N  "N Economic history"
{txt}
{com}. capture label variable JEL1_O  "O Development"
{txt}
{com}. capture label variable JEL1_P  "P Economic systems"
{txt}
{com}. capture label variable JEL1_Q  "Q Agri., environment"
{txt}
{com}. capture label variable JEL1_R  "R Regional, transport"
{txt}
{com}. capture label variable JEL1_Y  "Y Miscellaneous"
{txt}
{com}. capture label variable JEL1_Z  "Z Special topics"
{txt}
{com}. capture label variable InstRank "Inst. rank"
{txt}
{com}. capture label variable MaxInst "Max. inst. rank"
{txt}
{com}. capture label variable Maxt "Max. \(t\)"
{txt}
{com}. capture label variable Blind "Blind review"
{txt}
{com}. capture label variable NativeEnglish  "Native English speaker"
{txt}
{com}. capture label variable Fem50  "Majority female"
{txt}
{com}. capture label variable Fem100  "Exclusively female"
{txt}
{com}. capture label variable FemSenior  "Senior female"
{txt}
{com}. capture label variable FemJunior "Sr. female (\(t\le3\))"
{txt}
{com}. capture label variable FemSolo  "Solo female"
{txt}
{com}. capture label variable Fem1  "1+ female"
{txt}
{com}. capture label variable FirstInst  "\(t=1\) inst. rank"
{txt}
{com}. capture label variable article_r_fleschkincaid_score  "Flesch-Kincaid"
{txt}
{com}. capture label variable article_r_gunningfog_score  "Gunning Fog"
{txt}
{com}. capture label variable article_r_smog_score  "SMOG"
{txt}
{com}. capture label variable article_r_fleschkincaid_score  "Flesch-Kincaid"
{txt}
{com}. capture label variable article_r_gunningfog_score  "Gunning Fog"
{txt}
{com}. capture label variable article_r_smog_score  "SMOG"
{txt}
{com}. capture label variable Type_Theory  "Theory"
{txt}
{com}. capture label variable Type_Empirical  "Empirical"
{txt}
{com}. capture label variable Type_Other  "Other"
{txt}
{com}. 
{txt}end of do-file

{com}. do `vallabels'
{txt}
{com}. label define tbin 1 `"1"', modify
{txt}
{com}. label define tbin 2 `"2"', modify
{txt}
{com}. label define tbin 3 `"3-6"', modify
{txt}
{com}. label define tbin 4 `"7+"', modify
{txt}
{com}. label define sex 1 `"Female"', modify
{txt}
{com}. label define sex 2 `"Male"', modify
{txt}
{com}. label define gender 0 `"Men"', modify
{txt}
{com}. label define gender 1 `"Women"', modify
{txt}
{com}. label define jel_labels2 1 `"A General"', modify
{txt}
{com}. label define jel_labels2 2 `"B Heterodox"', modify
{txt}
{com}. label define jel_labels2 3 `"C Quant. methods"', modify
{txt}
{com}. label define jel_labels2 4 `"D Microeconomics"', modify
{txt}
{com}. label define jel_labels2 5 `"E Macroeconomics"', modify
{txt}
{com}. label define jel_labels2 6 `"F International"', modify
{txt}
{com}. label define jel_labels2 7 `"G Finance"', modify
{txt}
{com}. label define jel_labels2 8 `"H Public"', modify
{txt}
{com}. label define jel_labels2 9 `"I Health, welfare, edu."', modify
{txt}
{com}. label define jel_labels2 10 `"J Labour"', modify
{txt}
{com}. label define jel_labels2 11 `"K Law and econ."', modify
{txt}
{com}. label define jel_labels2 12 `"L Industrial org."', modify
{txt}
{com}. label define jel_labels2 13 `"M Marketing, accounting"', modify
{txt}
{com}. label define jel_labels2 14 `"N Economic history"', modify
{txt}
{com}. label define jel_labels2 15 `"O Development"', modify
{txt}
{com}. label define jel_labels2 16 `"P Economic systems"', modify
{txt}
{com}. label define jel_labels2 17 `"Q Agri., environment"', modify
{txt}
{com}. label define jel_labels2 18 `"R Regional, transport"', modify
{txt}
{com}. label define jel_labels2 19 `"Y Miscellaneous"', modify
{txt}
{com}. label define jel_labels2 20 `"Z Special topics"', modify
{txt}
{com}. label define jel_labels1 1 `"JEL1_A"', modify
{txt}
{com}. label define jel_labels1 2 `"JEL1_B"', modify
{txt}
{com}. label define jel_labels1 3 `"JEL1_C"', modify
{txt}
{com}. label define jel_labels1 4 `"JEL1_D"', modify
{txt}
{com}. label define jel_labels1 5 `"JEL1_E"', modify
{txt}
{com}. label define jel_labels1 6 `"JEL1_F"', modify
{txt}
{com}. label define jel_labels1 7 `"JEL1_G"', modify
{txt}
{com}. label define jel_labels1 8 `"JEL1_H"', modify
{txt}
{com}. label define jel_labels1 9 `"JEL1_I"', modify
{txt}
{com}. label define jel_labels1 10 `"JEL1_J"', modify
{txt}
{com}. label define jel_labels1 11 `"JEL1_K"', modify
{txt}
{com}. label define jel_labels1 12 `"JEL1_L"', modify
{txt}
{com}. label define jel_labels1 13 `"JEL1_M"', modify
{txt}
{com}. label define jel_labels1 14 `"JEL1_N"', modify
{txt}
{com}. label define jel_labels1 15 `"JEL1_O"', modify
{txt}
{com}. label define jel_labels1 16 `"JEL1_P"', modify
{txt}
{com}. label define jel_labels1 17 `"JEL1_Q"', modify
{txt}
{com}. label define jel_labels1 18 `"JEL1_R"', modify
{txt}
{com}. label define jel_labels1 19 `"JEL1_Y"', modify
{txt}
{com}. label define jel_labels1 20 `"JEL1_Z"', modify
{txt}
{com}. 
{txt}end of do-file

{com}. label values Female gender
{txt}
{com}. label values tBin tbin
{txt}
{com}. compress
  {txt}variable {bf}{res}t5{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Errata{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}T5{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Maxt{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}MaxT{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}N{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Senior{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}SeniorN{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}ManSenior{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}FemSolo{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Fem100{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Fem50{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Fem1{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}PubOrder{sf}{txt} was {bf}{res}int{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}t{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}T{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}AuthorWeight{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}AuthorEditor{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}tBin{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (866,970 bytes saved)

{com}. tempfile author
{txt}
{com}. save `author'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.00000n{rm}
saved
as .dta format
{p_end}

{com}. save "0-data/generated/author", replace
{txt}{p 0 4 2}
file {bf}
0-data/generated/author.dta{rm}
saved
{p_end}

{com}. 
. * Generate author-level data for all top five journals.
. import delimited "0-data/generated/article_top5.csv", clear varnames(1) case(preserve) encoding("utf-8") bindquotes(strict)
{res}{text}(9 vars, 11,695 obs)

{com}. merge 1:m ArticleID using `author_chars', assert(match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}          20,846{txt}  
{col 5}{hline 41}

{com}. label define Journal 1 "AER" 2 "ECA" 3 "JPE" 4 "QJE" 5 "P&P" 6 "RES"
{txt}
{com}. encode_replace Journal
{res}
{txt}
{com}. date_replace PubDate, mask("YMD")
{res}{txt}
{com}. keep if Errata==0 & Journal!=5
{txt}(1,318 observations deleted)

{com}. drop Errata
{txt}
{com}. * Downweight duplicate observations (i.e., co-authored papers).
. * Weights are inversely proportionate to the number of co-authors.
. bysort ArticleID: generate AuthorWeight = _N
{txt}
{com}. summarize AuthorWeight

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
AuthorWeight {c |}{res}     19,528    2.133245    .9110964          1          8
{txt}
{com}. replace AuthorWeight = r(max) + 1 - AuthorWeight
{txt}(19,528 real changes made)

{com}. xtset AuthorID t5
{res}
{col 1}{txt:Panel variable: }{res:AuthorID}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:t5}{txt:, }{res:{bind:1}}{txt: to }{res:{bind:59}}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. do `varlabels'
{txt}
{com}. capture label variable _flesch_score  "Flesch"
{txt}
{com}. capture label variable _fleschkincaid_score  "Flesch-Kincaid"
{txt}
{com}. capture label variable _gunningfog_score  "Gunning Fog"
{txt}
{com}. capture label variable _smog_score  "SMOG"
{txt}
{com}. capture label variable _dalechall_score  "Dale-Chall"
{txt}
{com}. capture label variable _sent_count  "No. sentences"
{txt}
{com}. capture label variable _char_count  "No. characters"
{txt}
{com}. capture label variable _sybl_count  "No. syllables"
{txt}
{com}. capture label variable _polysyblword_count  "No. polysyllabic words"
{txt}
{com}. capture label variable _word_count  "No. words"
{txt}
{com}. capture label variable _notdalechall_count  "No. difficult words"
{txt}
{com}. capture label variable _wps_count  "No. words / sentence count"
{txt}
{com}. capture label variable _pps_count  "No. polysyllabic words / sentence count"
{txt}
{com}. capture label variable _spw_count  "No. syllables / word count"
{txt}
{com}. capture label variable _pww_count  "No. polysyllabic words / word count"
{txt}
{com}. capture label variable _dww_count  "No. difficult words / word count"
{txt}
{com}. capture label variable FemRatio  "Female ratio"
{txt}
{com}. capture label variable MaxT  "Max. \(T\)"
{txt}
{com}. capture label variable PubN  "\(T\)"
{txt}
{com}. capture label variable N  "\(N_j\)"
{txt}
{com}. capture label variable T  "\(T_5\)"
{txt}
{com}. capture label variable tBin  "Publication count (4 bins)"
{txt}
{com}. capture label variable PubOrder  "Order"
{txt}
{com}. capture label variable PageN  "No. pages"
{txt}
{com}. capture label variable Mother  "Mother"
{txt}
{com}. capture label variable Birth  "Birth"
{txt}
{com}. capture label variable Sex  "Male"
{txt}
{com}. capture label variable CiteCount  "No. citations"
{txt}
{com}. capture label variable asinhCiteCount  "No. citations (asinh)"
{txt}
{com}. capture label variable NberWP  "NBER Working Paper"
{txt}
{com}. capture label variable Gender  "Author gender"
{txt}
{com}. capture label variable JEL1_1  "A General"
{txt}
{com}. capture label variable JEL1_2  "B Methodology"
{txt}
{com}. capture label variable JEL1_3  "C Quant. methods"
{txt}
{com}. capture label variable JEL1_4  "D Microeconomics"
{txt}
{com}. capture label variable JEL1_5  "E Macroeconomics"
{txt}
{com}. capture label variable JEL1_6  "F International"
{txt}
{com}. capture label variable JEL1_7  "G Finance"
{txt}
{com}. capture label variable JEL1_8  "H Public"
{txt}
{com}. capture label variable JEL1_9  "I Health, welfare, edu."
{txt}
{com}. capture label variable JEL1_10  "J Labour"
{txt}
{com}. capture label variable JEL1_11  "K Law and econ."
{txt}
{com}. capture label variable JEL1_12  "L Industrial org."
{txt}
{com}. capture label variable JEL1_13  "M Marketing, accounting"
{txt}
{com}. capture label variable JEL1_14  "N Economic history"
{txt}
{com}. capture label variable JEL1_15  "O Development"
{txt}
{com}. capture label variable JEL1_16  "P Economic systems"
{txt}
{com}. capture label variable JEL1_17  "Q Agri., environment"
{txt}
{com}. capture label variable JEL1_18  "R Regional, transport"
{txt}
{com}. capture label variable JEL1_19  "Y Miscellaneous"
{txt}
{com}. capture label variable JEL1_20  "Z Special topics"
{txt}
{com}. capture label variable AmericanName100  "\(100\) (U.S.)"
{txt}
{com}. capture label variable AmericanName1000  "\(1K\) (U.S.)"
{txt}
{com}. capture label variable AmericanName10000  "\(10K\) (U.S.)"
{txt}
{com}. capture label variable AmericanName100000  "\(100K\) (U.S.)"
{txt}
{com}. capture label variable AmericanName1000000  "\(1M\) (U.S.)"
{txt}
{com}. capture label variable ScottishName  "\(10\) (Scotland)"
{txt}
{com}. capture label variable meanPubOrder "Avg. order in issue"
{txt}
{com}. capture label variable minPubOrder "Min. order in issue"
{txt}
{com}. capture label variable meanN "Avg. \(N_{c -(}it{c )-}\)"
{txt}
{com}. capture label variable maxCiteCount "Max. citations"
{txt}
{com}. capture label variable meanYear "Avg. year"
{txt}
{com}. capture label variable AuthorOrderBin1 "\% no ordering"
{txt}
{com}. capture label variable AuthorOrderBin2 "\% first authored by \(i\)"
{txt}
{com}. capture label variable AuthorOrderBin3 "\% not first author"
{txt}
{com}. capture label variable Decade1 "1950--59"
{txt}
{com}. capture label variable Decade2 "1960--69"
{txt}
{com}. capture label variable Decade3 "1970--79"
{txt}
{com}. capture label variable Decade4 "1980--89"
{txt}
{com}. capture label variable Decade5 "1990--99"
{txt}
{com}. capture label variable Decade6 "2000--09"
{txt}
{com}. capture label variable Decade7 "2010--15"
{txt}
{com}. capture label variable minInstRank "Min. inst. rank"
{txt}
{com}. capture label variable meanInstRank "Avg. inst. rank"
{txt}
{com}. capture label variable maxInstRank "Max. inst. rank"
{txt}
{com}. capture label variable Journal1 "\textit{c -(}AER{c )-}"
{txt}
{com}. capture label variable Journal2 "\textit{c -(}Econometrica{c )-}"
{txt}
{com}. capture label variable Journal3 "\textit{c -(}JPE{c )-}"
{txt}
{com}. capture label variable Journal4 "\textit{c -(}QJE{c )-}"
{txt}
{com}. capture label variable JEL1_A  "A General"
{txt}
{com}. capture label variable JEL1_B  "B Methodology"
{txt}
{com}. capture label variable JEL1_C  "C Quant. methods"
{txt}
{com}. capture label variable JEL1_D  "D Microeconomics"
{txt}
{com}. capture label variable JEL1_E  "E Macroeconomics"
{txt}
{com}. capture label variable JEL1_F  "F International"
{txt}
{com}. capture label variable JEL1_G  "G Finance"
{txt}
{com}. capture label variable JEL1_H  "H Public"
{txt}
{com}. capture label variable JEL1_I  "I Health, welfare, edu."
{txt}
{com}. capture label variable JEL1_J  "J Labour"
{txt}
{com}. capture label variable JEL1_K  "K Law and econ."
{txt}
{com}. capture label variable JEL1_L  "L Industrial org."
{txt}
{com}. capture label variable JEL1_M  "M Marketing/acct."
{txt}
{com}. capture label variable JEL1_N  "N Economic history"
{txt}
{com}. capture label variable JEL1_O  "O Development"
{txt}
{com}. capture label variable JEL1_P  "P Economic systems"
{txt}
{com}. capture label variable JEL1_Q  "Q Agri., environment"
{txt}
{com}. capture label variable JEL1_R  "R Regional, transport"
{txt}
{com}. capture label variable JEL1_Y  "Y Miscellaneous"
{txt}
{com}. capture label variable JEL1_Z  "Z Special topics"
{txt}
{com}. capture label variable InstRank "Inst. rank"
{txt}
{com}. capture label variable MaxInst "Max. inst. rank"
{txt}
{com}. capture label variable Maxt "Max. \(t\)"
{txt}
{com}. capture label variable Blind "Blind review"
{txt}
{com}. capture label variable NativeEnglish  "Native English speaker"
{txt}
{com}. capture label variable Fem50  "Majority female"
{txt}
{com}. capture label variable Fem100  "Exclusively female"
{txt}
{com}. capture label variable FemSenior  "Senior female"
{txt}
{com}. capture label variable FemJunior "Sr. female (\(t\le3\))"
{txt}
{com}. capture label variable FemSolo  "Solo female"
{txt}
{com}. capture label variable Fem1  "1+ female"
{txt}
{com}. capture label variable FirstInst  "\(t=1\) inst. rank"
{txt}
{com}. capture label variable article_r_fleschkincaid_score  "Flesch-Kincaid"
{txt}
{com}. capture label variable article_r_gunningfog_score  "Gunning Fog"
{txt}
{com}. capture label variable article_r_smog_score  "SMOG"
{txt}
{com}. capture label variable article_r_fleschkincaid_score  "Flesch-Kincaid"
{txt}
{com}. capture label variable article_r_gunningfog_score  "Gunning Fog"
{txt}
{com}. capture label variable article_r_smog_score  "SMOG"
{txt}
{com}. capture label variable Type_Theory  "Theory"
{txt}
{com}. capture label variable Type_Empirical  "Empirical"
{txt}
{com}. capture label variable Type_Other  "Other"
{txt}
{com}. 
{txt}end of do-file

{com}. do `vallabels'
{txt}
{com}. label define tbin 1 `"1"', modify
{txt}
{com}. label define tbin 2 `"2"', modify
{txt}
{com}. label define tbin 3 `"3-6"', modify
{txt}
{com}. label define tbin 4 `"7+"', modify
{txt}
{com}. label define sex 1 `"Female"', modify
{txt}
{com}. label define sex 2 `"Male"', modify
{txt}
{com}. label define gender 0 `"Men"', modify
{txt}
{com}. label define gender 1 `"Women"', modify
{txt}
{com}. label define jel_labels2 1 `"A General"', modify
{txt}
{com}. label define jel_labels2 2 `"B Heterodox"', modify
{txt}
{com}. label define jel_labels2 3 `"C Quant. methods"', modify
{txt}
{com}. label define jel_labels2 4 `"D Microeconomics"', modify
{txt}
{com}. label define jel_labels2 5 `"E Macroeconomics"', modify
{txt}
{com}. label define jel_labels2 6 `"F International"', modify
{txt}
{com}. label define jel_labels2 7 `"G Finance"', modify
{txt}
{com}. label define jel_labels2 8 `"H Public"', modify
{txt}
{com}. label define jel_labels2 9 `"I Health, welfare, edu."', modify
{txt}
{com}. label define jel_labels2 10 `"J Labour"', modify
{txt}
{com}. label define jel_labels2 11 `"K Law and econ."', modify
{txt}
{com}. label define jel_labels2 12 `"L Industrial org."', modify
{txt}
{com}. label define jel_labels2 13 `"M Marketing, accounting"', modify
{txt}
{com}. label define jel_labels2 14 `"N Economic history"', modify
{txt}
{com}. label define jel_labels2 15 `"O Development"', modify
{txt}
{com}. label define jel_labels2 16 `"P Economic systems"', modify
{txt}
{com}. label define jel_labels2 17 `"Q Agri., environment"', modify
{txt}
{com}. label define jel_labels2 18 `"R Regional, transport"', modify
{txt}
{com}. label define jel_labels2 19 `"Y Miscellaneous"', modify
{txt}
{com}. label define jel_labels2 20 `"Z Special topics"', modify
{txt}
{com}. label define jel_labels1 1 `"JEL1_A"', modify
{txt}
{com}. label define jel_labels1 2 `"JEL1_B"', modify
{txt}
{com}. label define jel_labels1 3 `"JEL1_C"', modify
{txt}
{com}. label define jel_labels1 4 `"JEL1_D"', modify
{txt}
{com}. label define jel_labels1 5 `"JEL1_E"', modify
{txt}
{com}. label define jel_labels1 6 `"JEL1_F"', modify
{txt}
{com}. label define jel_labels1 7 `"JEL1_G"', modify
{txt}
{com}. label define jel_labels1 8 `"JEL1_H"', modify
{txt}
{com}. label define jel_labels1 9 `"JEL1_I"', modify
{txt}
{com}. label define jel_labels1 10 `"JEL1_J"', modify
{txt}
{com}. label define jel_labels1 11 `"JEL1_K"', modify
{txt}
{com}. label define jel_labels1 12 `"JEL1_L"', modify
{txt}
{com}. label define jel_labels1 13 `"JEL1_M"', modify
{txt}
{com}. label define jel_labels1 14 `"JEL1_N"', modify
{txt}
{com}. label define jel_labels1 15 `"JEL1_O"', modify
{txt}
{com}. label define jel_labels1 16 `"JEL1_P"', modify
{txt}
{com}. label define jel_labels1 17 `"JEL1_Q"', modify
{txt}
{com}. label define jel_labels1 18 `"JEL1_R"', modify
{txt}
{com}. label define jel_labels1 19 `"JEL1_Y"', modify
{txt}
{com}. label define jel_labels1 20 `"JEL1_Z"', modify
{txt}
{com}. 
{txt}end of do-file

{com}. label values Female gender
{txt}
{com}. compress
  {txt}variable {bf}{res}t5{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}T5{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Maxt{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}MaxT{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}N{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Senior{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}SeniorN{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}ManSenior{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}FemSolo{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Fem100{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Fem50{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Fem1{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Journal{sf}{txt} was {bf}{res}long{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}PubDate{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}AuthorWeight{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (859,232 bytes saved)

{com}. tempfile author5
{txt}
{com}. save `author5'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.00000o{rm}
saved
as .dta format
{p_end}

{com}. save "0-data/generated/author5", replace
{txt}{p 0 4 2}
file {bf}
0-data/generated/author5.dta{rm}
saved
{p_end}

{com}. 
. * Generate NBER data.
. import delimited "0-data/generated/nber.csv", clear varnames(1) case(preserve) encoding("utf-8") bindquotes(strict)
{res}{text}(5 vars, 22,880 obs)

{com}. reshape wide nber_, i(ArticleID NberID) j(StatName) string
{txt}(j = char_count dalechall_score flesch_score fleschkincaid_score gunningfog_score notdalechall_count polysyblword_count sent_count smog_score sybl_count word_count)

Data{col 36}Long{col 43}->{col 48}Wide
{hline 77}
Number of observations     {res}      22,880   {txt}->   {res}2,080       
{txt}Number of variables        {res}           5   {txt}->   {res}14          
{txt}j variable (11 values)         {res}StatName   {txt}->   (dropped)
xij variables:
                                  {res}nber_   {txt}->   {res}nber_char_count nber_dalechall_score ... nber_word_count
{txt}{hline 77}

{com}. merge m:1 ArticleID using `article', keep(match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           1,988{txt}  
{col 5}{hline 41}

{com}. generate nber_wps_count = nber_word_count / nber_sent_count
{txt}
{com}. generate nber_pps_count = nber_polysyblword_count / _sent_count
{txt}
{com}. generate nber_spw_count = nber_sybl_count / nber_word_count
{txt}
{com}. generate nber_pww_count = nber_polysyblword_count / nber_word_count
{txt}
{com}. generate nber_dww_count = nber_notdalechall_count / nber_word_count
{txt}
{com}. generate SemiBlind = (Journal==1&Year<2012|Journal==4&Year<2005)&Year>1997
{txt}
{com}. generate BelowAbstractLen = (Journal==3)|(Journal==4)|(nber_word_count<=100&Journal==1)|(nber_word_count<=150&Journal==2)
{txt}
{com}. date_replace WPDate, mask("YMD")
{res}{txt}
{com}. * Add readability data calculated using alternative program.
. merge 1:1 NberID using "0-data/generated/nberstat", assert(using match) keep(match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           1,988{txt}  
{col 5}{hline 41}

{com}. merge m:1 ArticleID using "0-data/generated/readstat", assert(using match) keep(match) nogenerate
{res}{txt}{p 0 7 2}
(variable
{bf:ArticleID} was {bf:int}, now {bf:long} to accommodate using data's values)
{p_end}

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           1,988{txt}  
{col 5}{hline 41}

{com}. do `varlabels'
{txt}
{com}. capture label variable _flesch_score  "Flesch"
{txt}
{com}. capture label variable _fleschkincaid_score  "Flesch-Kincaid"
{txt}
{com}. capture label variable _gunningfog_score  "Gunning Fog"
{txt}
{com}. capture label variable _smog_score  "SMOG"
{txt}
{com}. capture label variable _dalechall_score  "Dale-Chall"
{txt}
{com}. capture label variable _sent_count  "No. sentences"
{txt}
{com}. capture label variable _char_count  "No. characters"
{txt}
{com}. capture label variable _sybl_count  "No. syllables"
{txt}
{com}. capture label variable _polysyblword_count  "No. polysyllabic words"
{txt}
{com}. capture label variable _word_count  "No. words"
{txt}
{com}. capture label variable _notdalechall_count  "No. difficult words"
{txt}
{com}. capture label variable _wps_count  "No. words / sentence count"
{txt}
{com}. capture label variable _pps_count  "No. polysyllabic words / sentence count"
{txt}
{com}. capture label variable _spw_count  "No. syllables / word count"
{txt}
{com}. capture label variable _pww_count  "No. polysyllabic words / word count"
{txt}
{com}. capture label variable _dww_count  "No. difficult words / word count"
{txt}
{com}. capture label variable FemRatio  "Female ratio"
{txt}
{com}. capture label variable MaxT  "Max. \(T\)"
{txt}
{com}. capture label variable PubN  "\(T\)"
{txt}
{com}. capture label variable N  "\(N_j\)"
{txt}
{com}. capture label variable T  "\(T_5\)"
{txt}
{com}. capture label variable tBin  "Publication count (4 bins)"
{txt}
{com}. capture label variable PubOrder  "Order"
{txt}
{com}. capture label variable PageN  "No. pages"
{txt}
{com}. capture label variable Mother  "Mother"
{txt}
{com}. capture label variable Birth  "Birth"
{txt}
{com}. capture label variable Sex  "Male"
{txt}
{com}. capture label variable CiteCount  "No. citations"
{txt}
{com}. capture label variable asinhCiteCount  "No. citations (asinh)"
{txt}
{com}. capture label variable NberWP  "NBER Working Paper"
{txt}
{com}. capture label variable Gender  "Author gender"
{txt}
{com}. capture label variable JEL1_1  "A General"
{txt}
{com}. capture label variable JEL1_2  "B Methodology"
{txt}
{com}. capture label variable JEL1_3  "C Quant. methods"
{txt}
{com}. capture label variable JEL1_4  "D Microeconomics"
{txt}
{com}. capture label variable JEL1_5  "E Macroeconomics"
{txt}
{com}. capture label variable JEL1_6  "F International"
{txt}
{com}. capture label variable JEL1_7  "G Finance"
{txt}
{com}. capture label variable JEL1_8  "H Public"
{txt}
{com}. capture label variable JEL1_9  "I Health, welfare, edu."
{txt}
{com}. capture label variable JEL1_10  "J Labour"
{txt}
{com}. capture label variable JEL1_11  "K Law and econ."
{txt}
{com}. capture label variable JEL1_12  "L Industrial org."
{txt}
{com}. capture label variable JEL1_13  "M Marketing, accounting"
{txt}
{com}. capture label variable JEL1_14  "N Economic history"
{txt}
{com}. capture label variable JEL1_15  "O Development"
{txt}
{com}. capture label variable JEL1_16  "P Economic systems"
{txt}
{com}. capture label variable JEL1_17  "Q Agri., environment"
{txt}
{com}. capture label variable JEL1_18  "R Regional, transport"
{txt}
{com}. capture label variable JEL1_19  "Y Miscellaneous"
{txt}
{com}. capture label variable JEL1_20  "Z Special topics"
{txt}
{com}. capture label variable AmericanName100  "\(100\) (U.S.)"
{txt}
{com}. capture label variable AmericanName1000  "\(1K\) (U.S.)"
{txt}
{com}. capture label variable AmericanName10000  "\(10K\) (U.S.)"
{txt}
{com}. capture label variable AmericanName100000  "\(100K\) (U.S.)"
{txt}
{com}. capture label variable AmericanName1000000  "\(1M\) (U.S.)"
{txt}
{com}. capture label variable ScottishName  "\(10\) (Scotland)"
{txt}
{com}. capture label variable meanPubOrder "Avg. order in issue"
{txt}
{com}. capture label variable minPubOrder "Min. order in issue"
{txt}
{com}. capture label variable meanN "Avg. \(N_{c -(}it{c )-}\)"
{txt}
{com}. capture label variable maxCiteCount "Max. citations"
{txt}
{com}. capture label variable meanYear "Avg. year"
{txt}
{com}. capture label variable AuthorOrderBin1 "\% no ordering"
{txt}
{com}. capture label variable AuthorOrderBin2 "\% first authored by \(i\)"
{txt}
{com}. capture label variable AuthorOrderBin3 "\% not first author"
{txt}
{com}. capture label variable Decade1 "1950--59"
{txt}
{com}. capture label variable Decade2 "1960--69"
{txt}
{com}. capture label variable Decade3 "1970--79"
{txt}
{com}. capture label variable Decade4 "1980--89"
{txt}
{com}. capture label variable Decade5 "1990--99"
{txt}
{com}. capture label variable Decade6 "2000--09"
{txt}
{com}. capture label variable Decade7 "2010--15"
{txt}
{com}. capture label variable minInstRank "Min. inst. rank"
{txt}
{com}. capture label variable meanInstRank "Avg. inst. rank"
{txt}
{com}. capture label variable maxInstRank "Max. inst. rank"
{txt}
{com}. capture label variable Journal1 "\textit{c -(}AER{c )-}"
{txt}
{com}. capture label variable Journal2 "\textit{c -(}Econometrica{c )-}"
{txt}
{com}. capture label variable Journal3 "\textit{c -(}JPE{c )-}"
{txt}
{com}. capture label variable Journal4 "\textit{c -(}QJE{c )-}"
{txt}
{com}. capture label variable JEL1_A  "A General"
{txt}
{com}. capture label variable JEL1_B  "B Methodology"
{txt}
{com}. capture label variable JEL1_C  "C Quant. methods"
{txt}
{com}. capture label variable JEL1_D  "D Microeconomics"
{txt}
{com}. capture label variable JEL1_E  "E Macroeconomics"
{txt}
{com}. capture label variable JEL1_F  "F International"
{txt}
{com}. capture label variable JEL1_G  "G Finance"
{txt}
{com}. capture label variable JEL1_H  "H Public"
{txt}
{com}. capture label variable JEL1_I  "I Health, welfare, edu."
{txt}
{com}. capture label variable JEL1_J  "J Labour"
{txt}
{com}. capture label variable JEL1_K  "K Law and econ."
{txt}
{com}. capture label variable JEL1_L  "L Industrial org."
{txt}
{com}. capture label variable JEL1_M  "M Marketing/acct."
{txt}
{com}. capture label variable JEL1_N  "N Economic history"
{txt}
{com}. capture label variable JEL1_O  "O Development"
{txt}
{com}. capture label variable JEL1_P  "P Economic systems"
{txt}
{com}. capture label variable JEL1_Q  "Q Agri., environment"
{txt}
{com}. capture label variable JEL1_R  "R Regional, transport"
{txt}
{com}. capture label variable JEL1_Y  "Y Miscellaneous"
{txt}
{com}. capture label variable JEL1_Z  "Z Special topics"
{txt}
{com}. capture label variable InstRank "Inst. rank"
{txt}
{com}. capture label variable MaxInst "Max. inst. rank"
{txt}
{com}. capture label variable Maxt "Max. \(t\)"
{txt}
{com}. capture label variable Blind "Blind review"
{txt}
{com}. capture label variable NativeEnglish  "Native English speaker"
{txt}
{com}. capture label variable Fem50  "Majority female"
{txt}
{com}. capture label variable Fem100  "Exclusively female"
{txt}
{com}. capture label variable FemSenior  "Senior female"
{txt}
{com}. capture label variable FemJunior "Sr. female (\(t\le3\))"
{txt}
{com}. capture label variable FemSolo  "Solo female"
{txt}
{com}. capture label variable Fem1  "1+ female"
{txt}
{com}. capture label variable FirstInst  "\(t=1\) inst. rank"
{txt}
{com}. capture label variable article_r_fleschkincaid_score  "Flesch-Kincaid"
{txt}
{com}. capture label variable article_r_gunningfog_score  "Gunning Fog"
{txt}
{com}. capture label variable article_r_smog_score  "SMOG"
{txt}
{com}. capture label variable article_r_fleschkincaid_score  "Flesch-Kincaid"
{txt}
{com}. capture label variable article_r_gunningfog_score  "Gunning Fog"
{txt}
{com}. capture label variable article_r_smog_score  "SMOG"
{txt}
{com}. capture label variable Type_Theory  "Theory"
{txt}
{com}. capture label variable Type_Empirical  "Empirical"
{txt}
{com}. capture label variable Type_Other  "Other"
{txt}
{com}. 
{txt}end of do-file

{com}. compress
  {txt}variable {bf}{res}ArticleID{sf}{txt} was {bf}{res}long{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nber_char_count{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nber_notdalechall_count{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nber_polysyblword_count{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}nber_sent_count{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}nber_sybl_count{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}nber_word_count{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}_polysyblword_count{sf}{txt} was {bf}{res}int{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}PubOrder{sf}{txt} was {bf}{res}int{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}SemiBlind{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}BelowAbstractLen{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}WPDate{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
{txt}  (51,688 bytes saved)

{com}. tempfile nber
{txt}
{com}. save `nber'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.00000p{rm}
saved
as .dta format
{p_end}

{com}. save "0-data/generated/nber", replace
{txt}{p 0 4 2}
file {bf}
0-data/generated/nber.dta{rm}
saved
{p_end}

{com}. 
. * Generate data to use the change in score as a dependent variable.
. use `nber', clear
{txt}
{com}. reshape long @_score, i(NberID) j(stat) string
{txt}(j = _dalechall _flesch _fleschkincaid _gunningfog _r_fleschkincaid _r_gunningfog _r_smog _smog nber_dalechall nber_flesch nber_fleschkincaid nber_gunningfog nber_r_fleschkincaid nber_r_gunningfog nber_r_smog nber_smog)
_r_fleschkincaid_score:  {res}1988{txt} values would be changed; not changed
_r_gunningfog_score:  {res}1953{txt} values would be changed; not changed
_r_smog_score:  {res}1988{txt} values would be changed; not changed
nber_r_fleschkincaid_score:  {res}1988{txt} values would be changed; not changed
nber_r_gunningfog_score:  {res}1969{txt} values would be changed; not changed
nber_r_smog_score:  {res}1988{txt} values would be changed; not changed

Data{col 36}Wide{col 43}->{col 48}Long
{hline 77}
Number of observations     {res}       1,988   {txt}->   {res}31,808      
{txt}Number of variables        {res}          77   {txt}->   {res}63          
{txt}j variable (16 values)                    ->   {res}stat
{txt}xij variables:
{res}_dalechall_score _flesch_score ... nber_smog_score{txt}->{res}_score
{txt}{hline 77}

{com}. generate time = substr(stat, 1, 4)!="nber"
{txt}
{com}. replace stat = substr(stat, 5, .) if !time
{txt}(15,904 real changes made)

{com}. reshape wide _score, i(NberID time) j(stat) string
{txt}(j = _dalechall _flesch _fleschkincaid _gunningfog _r_fleschkincaid _r_gunningfog _r_smog _smog)

Data{col 36}Long{col 43}->{col 48}Wide
{hline 77}
Number of observations     {res}      31,808   {txt}->   {res}3,976       
{txt}Number of variables        {res}          64   {txt}->   {res}70          
{txt}j variable (8 values)              {res}stat   {txt}->   (dropped)
xij variables:
                                 {res}_score   {txt}->   {res}_score_dalechall _score_flesch ... _score_smog
{txt}{hline 77}

{com}. rename _score* *_score
{res}{txt}
{com}. egen id = group(NberID)
{txt}
{com}. do `varlabels'
{txt}
{com}. capture label variable _flesch_score  "Flesch"
{txt}
{com}. capture label variable _fleschkincaid_score  "Flesch-Kincaid"
{txt}
{com}. capture label variable _gunningfog_score  "Gunning Fog"
{txt}
{com}. capture label variable _smog_score  "SMOG"
{txt}
{com}. capture label variable _dalechall_score  "Dale-Chall"
{txt}
{com}. capture label variable _sent_count  "No. sentences"
{txt}
{com}. capture label variable _char_count  "No. characters"
{txt}
{com}. capture label variable _sybl_count  "No. syllables"
{txt}
{com}. capture label variable _polysyblword_count  "No. polysyllabic words"
{txt}
{com}. capture label variable _word_count  "No. words"
{txt}
{com}. capture label variable _notdalechall_count  "No. difficult words"
{txt}
{com}. capture label variable _wps_count  "No. words / sentence count"
{txt}
{com}. capture label variable _pps_count  "No. polysyllabic words / sentence count"
{txt}
{com}. capture label variable _spw_count  "No. syllables / word count"
{txt}
{com}. capture label variable _pww_count  "No. polysyllabic words / word count"
{txt}
{com}. capture label variable _dww_count  "No. difficult words / word count"
{txt}
{com}. capture label variable FemRatio  "Female ratio"
{txt}
{com}. capture label variable MaxT  "Max. \(T\)"
{txt}
{com}. capture label variable PubN  "\(T\)"
{txt}
{com}. capture label variable N  "\(N_j\)"
{txt}
{com}. capture label variable T  "\(T_5\)"
{txt}
{com}. capture label variable tBin  "Publication count (4 bins)"
{txt}
{com}. capture label variable PubOrder  "Order"
{txt}
{com}. capture label variable PageN  "No. pages"
{txt}
{com}. capture label variable Mother  "Mother"
{txt}
{com}. capture label variable Birth  "Birth"
{txt}
{com}. capture label variable Sex  "Male"
{txt}
{com}. capture label variable CiteCount  "No. citations"
{txt}
{com}. capture label variable asinhCiteCount  "No. citations (asinh)"
{txt}
{com}. capture label variable NberWP  "NBER Working Paper"
{txt}
{com}. capture label variable Gender  "Author gender"
{txt}
{com}. capture label variable JEL1_1  "A General"
{txt}
{com}. capture label variable JEL1_2  "B Methodology"
{txt}
{com}. capture label variable JEL1_3  "C Quant. methods"
{txt}
{com}. capture label variable JEL1_4  "D Microeconomics"
{txt}
{com}. capture label variable JEL1_5  "E Macroeconomics"
{txt}
{com}. capture label variable JEL1_6  "F International"
{txt}
{com}. capture label variable JEL1_7  "G Finance"
{txt}
{com}. capture label variable JEL1_8  "H Public"
{txt}
{com}. capture label variable JEL1_9  "I Health, welfare, edu."
{txt}
{com}. capture label variable JEL1_10  "J Labour"
{txt}
{com}. capture label variable JEL1_11  "K Law and econ."
{txt}
{com}. capture label variable JEL1_12  "L Industrial org."
{txt}
{com}. capture label variable JEL1_13  "M Marketing, accounting"
{txt}
{com}. capture label variable JEL1_14  "N Economic history"
{txt}
{com}. capture label variable JEL1_15  "O Development"
{txt}
{com}. capture label variable JEL1_16  "P Economic systems"
{txt}
{com}. capture label variable JEL1_17  "Q Agri., environment"
{txt}
{com}. capture label variable JEL1_18  "R Regional, transport"
{txt}
{com}. capture label variable JEL1_19  "Y Miscellaneous"
{txt}
{com}. capture label variable JEL1_20  "Z Special topics"
{txt}
{com}. capture label variable AmericanName100  "\(100\) (U.S.)"
{txt}
{com}. capture label variable AmericanName1000  "\(1K\) (U.S.)"
{txt}
{com}. capture label variable AmericanName10000  "\(10K\) (U.S.)"
{txt}
{com}. capture label variable AmericanName100000  "\(100K\) (U.S.)"
{txt}
{com}. capture label variable AmericanName1000000  "\(1M\) (U.S.)"
{txt}
{com}. capture label variable ScottishName  "\(10\) (Scotland)"
{txt}
{com}. capture label variable meanPubOrder "Avg. order in issue"
{txt}
{com}. capture label variable minPubOrder "Min. order in issue"
{txt}
{com}. capture label variable meanN "Avg. \(N_{c -(}it{c )-}\)"
{txt}
{com}. capture label variable maxCiteCount "Max. citations"
{txt}
{com}. capture label variable meanYear "Avg. year"
{txt}
{com}. capture label variable AuthorOrderBin1 "\% no ordering"
{txt}
{com}. capture label variable AuthorOrderBin2 "\% first authored by \(i\)"
{txt}
{com}. capture label variable AuthorOrderBin3 "\% not first author"
{txt}
{com}. capture label variable Decade1 "1950--59"
{txt}
{com}. capture label variable Decade2 "1960--69"
{txt}
{com}. capture label variable Decade3 "1970--79"
{txt}
{com}. capture label variable Decade4 "1980--89"
{txt}
{com}. capture label variable Decade5 "1990--99"
{txt}
{com}. capture label variable Decade6 "2000--09"
{txt}
{com}. capture label variable Decade7 "2010--15"
{txt}
{com}. capture label variable minInstRank "Min. inst. rank"
{txt}
{com}. capture label variable meanInstRank "Avg. inst. rank"
{txt}
{com}. capture label variable maxInstRank "Max. inst. rank"
{txt}
{com}. capture label variable Journal1 "\textit{c -(}AER{c )-}"
{txt}
{com}. capture label variable Journal2 "\textit{c -(}Econometrica{c )-}"
{txt}
{com}. capture label variable Journal3 "\textit{c -(}JPE{c )-}"
{txt}
{com}. capture label variable Journal4 "\textit{c -(}QJE{c )-}"
{txt}
{com}. capture label variable JEL1_A  "A General"
{txt}
{com}. capture label variable JEL1_B  "B Methodology"
{txt}
{com}. capture label variable JEL1_C  "C Quant. methods"
{txt}
{com}. capture label variable JEL1_D  "D Microeconomics"
{txt}
{com}. capture label variable JEL1_E  "E Macroeconomics"
{txt}
{com}. capture label variable JEL1_F  "F International"
{txt}
{com}. capture label variable JEL1_G  "G Finance"
{txt}
{com}. capture label variable JEL1_H  "H Public"
{txt}
{com}. capture label variable JEL1_I  "I Health, welfare, edu."
{txt}
{com}. capture label variable JEL1_J  "J Labour"
{txt}
{com}. capture label variable JEL1_K  "K Law and econ."
{txt}
{com}. capture label variable JEL1_L  "L Industrial org."
{txt}
{com}. capture label variable JEL1_M  "M Marketing/acct."
{txt}
{com}. capture label variable JEL1_N  "N Economic history"
{txt}
{com}. capture label variable JEL1_O  "O Development"
{txt}
{com}. capture label variable JEL1_P  "P Economic systems"
{txt}
{com}. capture label variable JEL1_Q  "Q Agri., environment"
{txt}
{com}. capture label variable JEL1_R  "R Regional, transport"
{txt}
{com}. capture label variable JEL1_Y  "Y Miscellaneous"
{txt}
{com}. capture label variable JEL1_Z  "Z Special topics"
{txt}
{com}. capture label variable InstRank "Inst. rank"
{txt}
{com}. capture label variable MaxInst "Max. inst. rank"
{txt}
{com}. capture label variable Maxt "Max. \(t\)"
{txt}
{com}. capture label variable Blind "Blind review"
{txt}
{com}. capture label variable NativeEnglish  "Native English speaker"
{txt}
{com}. capture label variable Fem50  "Majority female"
{txt}
{com}. capture label variable Fem100  "Exclusively female"
{txt}
{com}. capture label variable FemSenior  "Senior female"
{txt}
{com}. capture label variable FemJunior "Sr. female (\(t\le3\))"
{txt}
{com}. capture label variable FemSolo  "Solo female"
{txt}
{com}. capture label variable Fem1  "1+ female"
{txt}
{com}. capture label variable FirstInst  "\(t=1\) inst. rank"
{txt}
{com}. capture label variable article_r_fleschkincaid_score  "Flesch-Kincaid"
{txt}
{com}. capture label variable article_r_gunningfog_score  "Gunning Fog"
{txt}
{com}. capture label variable article_r_smog_score  "SMOG"
{txt}
{com}. capture label variable article_r_fleschkincaid_score  "Flesch-Kincaid"
{txt}
{com}. capture label variable article_r_gunningfog_score  "Gunning Fog"
{txt}
{com}. capture label variable article_r_smog_score  "SMOG"
{txt}
{com}. capture label variable Type_Theory  "Theory"
{txt}
{com}. capture label variable Type_Empirical  "Empirical"
{txt}
{com}. capture label variable Type_Other  "Other"
{txt}
{com}. 
{txt}end of do-file

{com}. xtset id time
{res}
{col 1}{txt:Panel variable: }{res:id}{txt: (strongly balanced)}
{p 1 16 2}{txt:Time variable: }{res:time}{txt:, }{res:{bind:0}}{txt: to }{res:{bind:1}}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. tempfile nber_fe
{txt}
{com}. save `nber_fe'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.00000q{rm}
saved
as .dta format
{p_end}

{com}. save "0-data/generated/nber_fe", replace
{txt}{p 0 4 2}
file {bf}
0-data/generated/nber_fe.dta{rm}
saved
{p_end}

{com}. 
. * Add JEL codes to FGLS and FE data.
. use `nber'
{txt}
{com}. merge m:1 ArticleID using `primary_jel', keep(match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           1,703{txt}  
{col 5}{hline 41}

{com}. tempfile nber_jel
{txt}
{com}. save `nber_jel'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.00000r{rm}
saved
as .dta format
{p_end}

{com}. use `nber_fe'
{txt}
{com}. merge m:1 ArticleID using `primary_jel', keep(match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           3,406{txt}  
{col 5}{hline 41}

{com}. sort id time
{txt}
{com}. tempfile nber_fe_jel
{txt}
{com}. save `nber_fe_jel'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.00000s{rm}
saved
as .dta format
{p_end}

{com}. save "0-data/generated/nber_fe_jel", replace
{txt}{p 0 4 2}
file {bf}
0-data/generated/nber_fe_jel.dta{rm}
saved
{p_end}

{com}. 
. * Generate review time data.
. import delimited "0-data/generated/time.csv", clear varnames(1) case(preserve) encoding("utf-8") bindquotes(strict)
{res}{text}(16 vars, 7,603 obs)

{com}. merge m:1 ArticleID using `article_chars', assert(using match) keep(match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           7,603{txt}  
{col 5}{hline 41}

{com}. merge m:1 ArticleID using `article_instrank', keep(master match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           7,603{txt}  
{col 5}{hline 41}

{com}. merge m:1 ArticleID using `order', assert(using match) keep(match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           7,603{txt}  
{col 5}{hline 41}

{com}. merge m:1 ArticleID using `cluster', assert(using match) keep(match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           7,603{txt}  
{col 5}{hline 41}

{com}. merge m:1 ArticleID using `english', assert(using match) keep(match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           7,603{txt}  
{col 5}{hline 41}

{com}. merge m:1 ArticleID using `type', assert(using match) keep(match) nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           7,603{txt}  
{col 5}{hline 41}

{com}. generate asinhCiteCount = ln(CiteCount + sqrt(1+CiteCount^2))
{txt}
{com}. date_replace PubDate, mask("YMD")
{res}{txt}
{com}. date_replace Received, mask("YMD")
{res}{txt}
{com}. date_replace Accepted, mask("YMD")
{res}{txt}
{com}. label define Journal 1 "AER" 2 "ECA" 3 "JPE" 4 "QJE" 5 "P&P" 6 "RES"
{txt}
{com}. encode_replace Journal
{res}
{txt}
{com}. merge m:1 ArticleID using `article', keep(master match) keepusing(_flesch_score) nogenerate
{res}{txt}(label {bf:{txt}Journal} already defined)

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}           3,085
{txt}{col 9}from master{col 30}{res}           3,085{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}Matched{col 30}{res}           4,518{txt}  
{col 5}{hline 41}

{com}. do `varlabels'
{txt}
{com}. capture label variable _flesch_score  "Flesch"
{txt}
{com}. capture label variable _fleschkincaid_score  "Flesch-Kincaid"
{txt}
{com}. capture label variable _gunningfog_score  "Gunning Fog"
{txt}
{com}. capture label variable _smog_score  "SMOG"
{txt}
{com}. capture label variable _dalechall_score  "Dale-Chall"
{txt}
{com}. capture label variable _sent_count  "No. sentences"
{txt}
{com}. capture label variable _char_count  "No. characters"
{txt}
{com}. capture label variable _sybl_count  "No. syllables"
{txt}
{com}. capture label variable _polysyblword_count  "No. polysyllabic words"
{txt}
{com}. capture label variable _word_count  "No. words"
{txt}
{com}. capture label variable _notdalechall_count  "No. difficult words"
{txt}
{com}. capture label variable _wps_count  "No. words / sentence count"
{txt}
{com}. capture label variable _pps_count  "No. polysyllabic words / sentence count"
{txt}
{com}. capture label variable _spw_count  "No. syllables / word count"
{txt}
{com}. capture label variable _pww_count  "No. polysyllabic words / word count"
{txt}
{com}. capture label variable _dww_count  "No. difficult words / word count"
{txt}
{com}. capture label variable FemRatio  "Female ratio"
{txt}
{com}. capture label variable MaxT  "Max. \(T\)"
{txt}
{com}. capture label variable PubN  "\(T\)"
{txt}
{com}. capture label variable N  "\(N_j\)"
{txt}
{com}. capture label variable T  "\(T_5\)"
{txt}
{com}. capture label variable tBin  "Publication count (4 bins)"
{txt}
{com}. capture label variable PubOrder  "Order"
{txt}
{com}. capture label variable PageN  "No. pages"
{txt}
{com}. capture label variable Mother  "Mother"
{txt}
{com}. capture label variable Birth  "Birth"
{txt}
{com}. capture label variable Sex  "Male"
{txt}
{com}. capture label variable CiteCount  "No. citations"
{txt}
{com}. capture label variable asinhCiteCount  "No. citations (asinh)"
{txt}
{com}. capture label variable NberWP  "NBER Working Paper"
{txt}
{com}. capture label variable Gender  "Author gender"
{txt}
{com}. capture label variable JEL1_1  "A General"
{txt}
{com}. capture label variable JEL1_2  "B Methodology"
{txt}
{com}. capture label variable JEL1_3  "C Quant. methods"
{txt}
{com}. capture label variable JEL1_4  "D Microeconomics"
{txt}
{com}. capture label variable JEL1_5  "E Macroeconomics"
{txt}
{com}. capture label variable JEL1_6  "F International"
{txt}
{com}. capture label variable JEL1_7  "G Finance"
{txt}
{com}. capture label variable JEL1_8  "H Public"
{txt}
{com}. capture label variable JEL1_9  "I Health, welfare, edu."
{txt}
{com}. capture label variable JEL1_10  "J Labour"
{txt}
{com}. capture label variable JEL1_11  "K Law and econ."
{txt}
{com}. capture label variable JEL1_12  "L Industrial org."
{txt}
{com}. capture label variable JEL1_13  "M Marketing, accounting"
{txt}
{com}. capture label variable JEL1_14  "N Economic history"
{txt}
{com}. capture label variable JEL1_15  "O Development"
{txt}
{com}. capture label variable JEL1_16  "P Economic systems"
{txt}
{com}. capture label variable JEL1_17  "Q Agri., environment"
{txt}
{com}. capture label variable JEL1_18  "R Regional, transport"
{txt}
{com}. capture label variable JEL1_19  "Y Miscellaneous"
{txt}
{com}. capture label variable JEL1_20  "Z Special topics"
{txt}
{com}. capture label variable AmericanName100  "\(100\) (U.S.)"
{txt}
{com}. capture label variable AmericanName1000  "\(1K\) (U.S.)"
{txt}
{com}. capture label variable AmericanName10000  "\(10K\) (U.S.)"
{txt}
{com}. capture label variable AmericanName100000  "\(100K\) (U.S.)"
{txt}
{com}. capture label variable AmericanName1000000  "\(1M\) (U.S.)"
{txt}
{com}. capture label variable ScottishName  "\(10\) (Scotland)"
{txt}
{com}. capture label variable meanPubOrder "Avg. order in issue"
{txt}
{com}. capture label variable minPubOrder "Min. order in issue"
{txt}
{com}. capture label variable meanN "Avg. \(N_{c -(}it{c )-}\)"
{txt}
{com}. capture label variable maxCiteCount "Max. citations"
{txt}
{com}. capture label variable meanYear "Avg. year"
{txt}
{com}. capture label variable AuthorOrderBin1 "\% no ordering"
{txt}
{com}. capture label variable AuthorOrderBin2 "\% first authored by \(i\)"
{txt}
{com}. capture label variable AuthorOrderBin3 "\% not first author"
{txt}
{com}. capture label variable Decade1 "1950--59"
{txt}
{com}. capture label variable Decade2 "1960--69"
{txt}
{com}. capture label variable Decade3 "1970--79"
{txt}
{com}. capture label variable Decade4 "1980--89"
{txt}
{com}. capture label variable Decade5 "1990--99"
{txt}
{com}. capture label variable Decade6 "2000--09"
{txt}
{com}. capture label variable Decade7 "2010--15"
{txt}
{com}. capture label variable minInstRank "Min. inst. rank"
{txt}
{com}. capture label variable meanInstRank "Avg. inst. rank"
{txt}
{com}. capture label variable maxInstRank "Max. inst. rank"
{txt}
{com}. capture label variable Journal1 "\textit{c -(}AER{c )-}"
{txt}
{com}. capture label variable Journal2 "\textit{c -(}Econometrica{c )-}"
{txt}
{com}. capture label variable Journal3 "\textit{c -(}JPE{c )-}"
{txt}
{com}. capture label variable Journal4 "\textit{c -(}QJE{c )-}"
{txt}
{com}. capture label variable JEL1_A  "A General"
{txt}
{com}. capture label variable JEL1_B  "B Methodology"
{txt}
{com}. capture label variable JEL1_C  "C Quant. methods"
{txt}
{com}. capture label variable JEL1_D  "D Microeconomics"
{txt}
{com}. capture label variable JEL1_E  "E Macroeconomics"
{txt}
{com}. capture label variable JEL1_F  "F International"
{txt}
{com}. capture label variable JEL1_G  "G Finance"
{txt}
{com}. capture label variable JEL1_H  "H Public"
{txt}
{com}. capture label variable JEL1_I  "I Health, welfare, edu."
{txt}
{com}. capture label variable JEL1_J  "J Labour"
{txt}
{com}. capture label variable JEL1_K  "K Law and econ."
{txt}
{com}. capture label variable JEL1_L  "L Industrial org."
{txt}
{com}. capture label variable JEL1_M  "M Marketing/acct."
{txt}
{com}. capture label variable JEL1_N  "N Economic history"
{txt}
{com}. capture label variable JEL1_O  "O Development"
{txt}
{com}. capture label variable JEL1_P  "P Economic systems"
{txt}
{com}. capture label variable JEL1_Q  "Q Agri., environment"
{txt}
{com}. capture label variable JEL1_R  "R Regional, transport"
{txt}
{com}. capture label variable JEL1_Y  "Y Miscellaneous"
{txt}
{com}. capture label variable JEL1_Z  "Z Special topics"
{txt}
{com}. capture label variable InstRank "Inst. rank"
{txt}
{com}. capture label variable MaxInst "Max. inst. rank"
{txt}
{com}. capture label variable Maxt "Max. \(t\)"
{txt}
{com}. capture label variable Blind "Blind review"
{txt}
{com}. capture label variable NativeEnglish  "Native English speaker"
{txt}
{com}. capture label variable Fem50  "Majority female"
{txt}
{com}. capture label variable Fem100  "Exclusively female"
{txt}
{com}. capture label variable FemSenior  "Senior female"
{txt}
{com}. capture label variable FemJunior "Sr. female (\(t\le3\))"
{txt}
{com}. capture label variable FemSolo  "Solo female"
{txt}
{com}. capture label variable Fem1  "1+ female"
{txt}
{com}. capture label variable FirstInst  "\(t=1\) inst. rank"
{txt}
{com}. capture label variable article_r_fleschkincaid_score  "Flesch-Kincaid"
{txt}
{com}. capture label variable article_r_gunningfog_score  "Gunning Fog"
{txt}
{com}. capture label variable article_r_smog_score  "SMOG"
{txt}
{com}. capture label variable article_r_fleschkincaid_score  "Flesch-Kincaid"
{txt}
{com}. capture label variable article_r_gunningfog_score  "Gunning Fog"
{txt}
{com}. capture label variable article_r_smog_score  "SMOG"
{txt}
{com}. capture label variable Type_Theory  "Theory"
{txt}
{com}. capture label variable Type_Empirical  "Empirical"
{txt}
{com}. capture label variable Type_Other  "Other"
{txt}
{com}. 
{txt}end of do-file

{com}. compress
  {txt}variable {bf}{res}Maxt{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}MaxT{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}N{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}SeniorN{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}ManSenior{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}FemSolo{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Fem100{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Fem50{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Fem1{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Errata{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}PubOrder{sf}{txt} was {bf}{res}int{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Volume{sf}{txt} was {bf}{res}int{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Editor{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}Type_Empirical{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Type_Other{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Type_Theory{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}PubDate{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}Received{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}Accepted{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}Journal{sf}{txt} was {bf}{res}long{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}Issue{sf}{txt} was {bf}{res}str10{sf}{txt} now {bf}{res}str3{sf}
{txt}  (448,577 bytes saved)

{com}. tempfile duration
{txt}
{com}. save `duration'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.00000t{rm}
saved
as .dta format
{p_end}

{com}. save "0-data/generated/duration", replace
{txt}{p 0 4 2}
file {bf}
0-data/generated/duration.dta{rm}
saved
{p_end}

{com}. 
. * Get author names for matched pair table
. import delimited "0-data/generated/author_names.csv", clear varnames(1) case(preserve) encoding("utf-8") bindquotes(strict)
{res}{text}(2 vars, 8,209 obs)

{com}. tempfile names
{txt}
{com}. save `names'
{txt}{p 0 4 2}
file {bf}
/var/folders/mb/h97s4c9j4f35wz2q_ymhsjc40000gp/T//S_14661.00000u{rm}
saved
as .dta format
{p_end}

{com}. ********************************************************************************
. {txt}
{com}. 
. * Run analyses.
. include "0-code/output/Figure-1.do"
{txt}
{com}. ********************************************************************************
. ** Figure 1: Relationship between readability and the ratio of female authors **
. ********************************************************************************
. use `article', clear
{txt}
{com}. recode FemRatio0 (0=0) (0.1/0.4=0.25) (0.5=0.5) (0.6/0.8=0.75) (1=1), generate(FemBin)
{txt}(296 differences between {bf:FemRatio0} and {bf:FemBin})

{com}. regress _flesch_score FemBin

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     9,117
{txt}{hline 13}{c +}{hline 34}   F(1, 9115)      = {res}    10.45
{txt}       Model {c |} {res} 1598.47555         1  1598.47555   {txt}Prob > F        ={res}    0.0012
{txt}    Residual {c |} {res} 1394479.46     9,115  152.987324   {txt}R-squared       ={res}    0.0011
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0010
{txt}       Total {c |} {res} 1396077.94     9,116  153.145891   {txt}Root MSE        =   {res} 12.369

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}_flesch_sc~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}FemBin {c |}{col 14}{res}{space 2} 1.923655{col 26}{space 2} .5951165{col 37}{space 1}    3.23{col 46}{space 3}0.001{col 54}{space 4} .7570935{col 67}{space 3} 3.090217
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 39.51776{col 26}{space 2} .1367647{col 37}{space 1}  288.95{col 46}{space 3}0.000{col 54}{space 4} 39.24967{col 67}{space 3} 39.78585
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. local beta_text = string(_b[FemBin],"%03.2f")
{txt}
{com}. local se_text = string(_se[FemBin],"%03.2f")
{txt}
{com}. binscatter _flesch_score FemBin, ///
>   scheme(publishing-female) ///
>   linetype(lfit) ///
>   discrete ///
>   color(pfblue pfblue) ///
>   xtitle("Ratio of female authors", size(medium)) ///
>   ytitle("Flesch Reading Ease", size(medium)) ///
>   text(41.5 0.8 `"{c -(}fontface "Avenir-Light"{c )-}{c -(}it:{c -(}&beta{c )-}{c )-} = `beta_text'"' "(`se_text')", color(gray)) ///
>   xlabel(0.25 0.5 0.75 1) ///
>   aspectratio(0.4)
{res}{txt}
{com}. graph export "0-images/generated/Figure-1.pdf", replace fontface("Avenir-Light") as(pdf)
{txt}{p 0 4 2}
file {bf}
/Users/erinhengel/Dropbox/Readability/draft/0-images/generated/Figure-1.pdf{rm}
saved as
PDF
format
{p_end}

{com}. ********************************************************************************
. {txt}
{com}. // include "0-code/output/Figure-2.do"
. // include "0-code/output/Table-2.do"
. // include "0-code/output/Table-3.do"
. // include "0-code/output/Table-4.do"
. // include "0-code/output/Table-5.do"
. // include "0-code/output/Table-6.do"
. // include "0-code/output/Table-7.do"
. // include "0-code/output/Figure-4.do"
. // include "0-code/output/Table-8.do"
. // include "0-code/output/Section-4.3.do"
. // include "0-code/output/Figure-6.do"
. // include "0-code/output/Table-10.do"
. // include "0-code/output/Table-B.1.do"
. // include "0-code/output/Table-C.1.do"
. // include "0-code/output/Figure-D.1.do"
. // include "0-code/output/Figure-D.2.do"
. // include "0-code/output/Table-F.1.do"
. // include "0-code/output/Figure-F.1.do"
. // include "0-code/output/Table-F.2.do"
. // include "0-code/output/Table-G.1.do"
. // include "0-code/output/Table-G.2.do"
. // include "0-code/output/Figure-G.1.do"
. // include "0-code/output/Table-G.4.do"
. // include "0-code/output/Table-H.3.do"
. // include "0-code/output/Table-H.4.do"
. // include "0-code/output/Table-I.2.do"
. // include "0-code/output/Table-J.2.do"
. // include "0-code/output/Figure-K.1.do"
. 
. * List timer, close log and exit.
. timer off 1
{txt}
{com}. timer list 1
{res}   1:     13.95 /        1 =      13.9490
{txt}
{com}. display as error "Time to run code: `r(t1)' seconds"
{res}{err}Time to run code: 13.949 seconds
{txt}
{com}. log close last_log
      {txt}name:  {res}last_log
       {txt}log:  {res}/Users/erinhengel/Dropbox/Readability/draft/0-log/2022-03-21-15-23-31.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}21 Mar 2022, 15:23:45
{txt}{.-}
{smcl}
{txt}{sf}{ul off}